[
  {
    "id": "f9ba180a-3be7-40e3-b7a1-68dc3f76cc3a",
    "text": "ID: T0827\nName: Loss of Control\nDescription: Adversaries may seek to achieve a sustained loss of control or a runaway condition in which operators cannot issue any commands even if the malicious interference has subsided. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nThe German Federal Office for Information Security (BSI) reported a targeted attack on a steel mill in its 2014 IT Security Report.(Citation: BSI State of IT Security 2014) These targeted attacks affected industrial operations and resulted in breakdowns of control system components and even entire installations. As a result of these breakdowns, massive impact resulted in damage and unsafe conditions from the uncontrolled shutdown of a blast furnace.\nMitigation: Data Backup, Out-of-Band Communications Channel, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0827",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "1533872c-8ef4-4c93-8c33-85774175a39b",
    "text": "ID: T0866\nName: Exploitation of Remote Services\nDescription: Adversaries may exploit a software vulnerability to take advantage of a programming error in a program, service, or within the operating system software or kernel itself to enable remote service abuse. A common goal for post-compromise exploitation of remote services is for initial access into and lateral movement throughout the ICS environment to enable access to targeted systems. (Citation: Enterprise ATT&CK)\n\nICS asset owners and operators have been affected by ransomware (or disruptive malware masquerading as ransomware) migrating from enterprise IT to ICS environments: WannaCry, NotPetya, and BadRabbit. In each of these cases, self-propagating (wormable) malware initially infected IT networks, but through exploit (particularly the SMBv1-targeting MS17-010 vulnerability) spread to industrial networks, producing significant impacts. (Citation: Joe Slowik April 2019)\nDetection: Application Log Content, Network Traffic Content\nMitigation: Application Isolation and Sandboxing, Disable or Remove Feature or Program, Exploit Protection, Network Segmentation, Privileged Account Management, Threat Intelligence Program, Update Software, Vulnerability Scanning",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0866",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "2e2f871f-e8c9-4312-aee8-5ec6d33a8c73",
    "text": "ID: T0866\nName: Exploitation of Remote Services\nDescription: Adversaries may exploit a software vulnerability to take advantage of a programming error in a program, service, or within the operating system software or kernel itself to enable remote service abuse. A common goal for post-compromise exploitation of remote services is for initial access into and lateral movement throughout the ICS environment to enable access to targeted systems. (Citation: Enterprise ATT&CK)\n\nICS asset owners and operators have been affected by ransomware (or disruptive malware masquerading as ransomware) migrating from enterprise IT to ICS environments: WannaCry, NotPetya, and BadRabbit. In each of these cases, self-propagating (wormable) malware initially infected IT networks, but through exploit (particularly the SMBv1-targeting MS17-010 vulnerability) spread to industrial networks, producing significant impacts. (Citation: Joe Slowik April 2019)\nDetection: Application Log Content, Network Traffic Content\nMitigation: Application Isolation and Sandboxing, Disable or Remove Feature or Program, Exploit Protection, Network Segmentation, Privileged Account Management, Threat Intelligence Program, Update Software, Vulnerability Scanning",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0866",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "fd40c813-395a-42ea-b5e2-6a664df1c207",
    "text": "ID: T0889\nName: Modify Program\nDescription: Adversaries may modify or add a program on a controller to affect how it interacts with the physical process, peripheral devices and other hosts on the network. Modification to controller programs can be accomplished using a Program Download in addition to other types of program modification such as online edit and program append. \n\nProgram modification encompasses the addition and modification of instructions and logic contained in Program Organization Units (POU)  (Citation: IEC February 2013) and similar programming elements found on controllers. This can include, for example, adding new functions to a controller, modifying the logic in existing functions and making new calls from one function to another. \n\nSome programs may allow an adversary to interact directly with the native API of the controller to take advantage of obscure features or vulnerabilities.\nDetection: Application Log Content, Software, Network Traffic Content, Device Alarm\nMitigation: Audit, Authorization Enforcement, Code Signing, Human User Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0889",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "4b1fa713-11a8-44b3-be99-d0a4f4cab596",
    "text": "ID: T0831\nName: Manipulation of Control\nDescription: Adversaries may manipulate physical process control within the industrial environment. Methods of manipulating control can include changes to set point values, tags, or other parameters. Adversaries may manipulate control systems devices or possibly leverage their own, to communicate with and command physical control processes. The duration of manipulation may be temporary or longer sustained, depending on operator detection.   \n\nMethods of Manipulation of Control include: \n\n* Man-in-the-middle  \n* Spoof command message \n* Changing setpoints  \n\nA Polish student used a remote controller device to interface with the Lodz city tram system in Poland. (Citation: John Bill May 2017) (Citation: Shelley Smith February 2008) (Citation: Bruce Schneier January 2008) Using this remote, the student was able to capture and replay legitimate tram signals. As a consequence, four trams were derailed and twelve people injured due to resulting emergency stops. (Citation: Shelley Smith February 2008) The track controlling commands issued may have also resulted in tram collisions, a further risk to those on board and nearby the areas of impact. (Citation: Bruce Schneier January 2008)\nMitigation: Communication Authenticity, Data Backup, Out-of-Band Communications Channel",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0831",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "6437e339-35f2-4dd0-975b-97f177c8be3f",
    "text": "ID: T0846\nName: Remote System Discovery\nDescription: Adversaries may attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for subsequent Lateral Movement or Discovery techniques. Functionality could exist within adversary tools to enable this, but utilities available on the operating system or vendor software could also be used. (Citation: Enterprise ATT&CK January 2018)\nDetection: File Access, Network Traffic Content, Network Traffic Flow, Process Creation\nMitigation: Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0846",
      "tactic": "Discovery",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "51aabed3-c47b-49f1-9121-823ee2126873",
    "text": "ID: T0811\nName: Data from Information Repositories\nDescription: Adversaries may target and collect data from information repositories. This can include sensitive data such as specifications, schematics, or diagrams of control system layouts, devices, and processes. Examples of information repositories include reference databases in the process environment, as well as databases in the corporate network that might contain information about the ICS.(Citation: Cybersecurity & Infrastructure Security Agency March 2018)\n\nInformation collected from these systems may provide the adversary with a better understanding of the operational environment, vendors used, processes, or procedures of the ICS.\n\nIn a campaign between 2011 and 2013 against ONG organizations, Chinese state-sponsored actors searched document repositories for specific information such as, system manuals, remote terminal unit (RTU) sites, personnel lists, documents that included the string SCAD*, user credentials, and remote dial-up access information. (Citation: CISA AA21-201A Pipeline Intrusion July 2021)\nDetection: Application Log Content, Logon Session Creation, Network Share Access\nMitigation: Audit, Encrypt Sensitive Information, Privileged Account Management, Restrict File and Directory Permissions, User Account Management, User Training",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0811",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "a9a7bca1-8030-460d-991b-2c48e1207624",
    "text": "ID: T0807\nName: Command-Line Interface\nDescription: Adversaries may utilize command-line interfaces (CLIs) to interact with systems and execute commands. CLIs provide a means of interacting with computer systems and are a common feature across many types of platforms and devices within control systems environments. (Citation: Enterprise ATT&CK January 2018) Adversaries may also use CLIs to install and run new software, including malicious tools that may be installed over the course of an operation.\n\nCLIs are typically accessed locally, but can also be exposed via services, such as SSH, Telnet, and RDP.  Commands that are executed in the CLI execute with the current permissions level of the process running the terminal emulator, unless the command specifies a change in permissions context. Many controllers have CLI interfaces for management purposes.\nDetection: Application Log Content, Command Execution, Process Creation\nMitigation: Disable or Remove Feature or Program, Execution Prevention",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0807",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "e4568c47-0e51-43dd-b664-fe8a062d9368",
    "text": "ID: T0893\nName: Data from Local System\nDescription: Adversaries may target and collect data from local system sources, such as file systems, configuration files, or local databases. This can include sensitive data such as specifications, schematics, or diagrams of control system layouts, devices, and processes.\n\nAdversaries may do this using [Command-Line Interface](https://attack.mitre.org/techniques/T0807) or [Scripting](https://attack.mitre.org/techniques/T0853) techniques to interact with the file system to gather information. Adversaries may also use [Automated Collection](https://attack.mitre.org/techniques/T0802) on the local system. \nDetection: Command Execution, File Access, OS API Execution, Process Creation, Script Execution\nMitigation: Data Loss Prevention, Encrypt Sensitive Information, Restrict File and Directory Permissions, User Training",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0893",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5b046c1b-66f8-46b2-a842-ef676ead8123",
    "text": "ID: T0885\nName: Commonly Used Port\nDescription: Adversaries may communicate over a commonly used port to bypass firewalls or network detection systems and to blend in with normal network activity, to avoid more detailed inspection. They may use the protocol associated with the port, or a completely different protocol. They may use commonly open ports, such as the examples provided below. \n \n * TCP:80 (HTTP) \n * TCP:443 (HTTPS) \n * TCP/UDP:53 (DNS) \n * TCP:1024-4999 (OPC on XP/Win2k3) \n * TCP:49152-65535 (OPC on Vista and later) \n * TCP:23 (TELNET) \n * UDP:161 (SNMP) \n * TCP:502 (MODBUS) \n * TCP:102 (S7comm/ISO-TSAP) \n * TCP:20000 (DNP3) \n * TCP:44818 (Ethernet/IP)\nDetection: Network Traffic Content, Network Traffic Flow\nMitigation: Disable or Remove Feature or Program, Human User Authentication, Network Intrusion Prevention, Network Segmentation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0885",
      "tactic": "Command and Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "453f962f-1593-4ae1-ba55-ad37b3103201",
    "text": "ID: T0884\nName: Connection Proxy\nDescription: Adversaries may use a connection proxy to direct network traffic between systems or act as an intermediary for network communications.\n\nThe definition of a proxy can also be expanded to encompass trust relationships between networks in peer-to-peer, mesh, or trusted connections between networks consisting of hosts or systems that regularly communicate with each other.\n\nThe network may be within a single organization or across multiple organizations with trust relationships. Adversaries could use these types of relationships to manage command and control communications, to reduce the number of simultaneous outbound network connections, to provide resiliency in the face of connection loss, or to ride over existing trusted communications paths between victims to avoid suspicion. (Citation: Enterprise ATT&CK January 2018)\nDetection: Network Traffic Content, Network Traffic Flow\nMitigation: Filter Network Traffic, Network Allowlists, Network Intrusion Prevention, SSL/TLS Inspection",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0884",
      "tactic": "Command and Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "12b8d517-1dde-4280-8c7b-818938adf716",
    "text": "ID: T0892\nName: Change Credential\nDescription: Adversaries may modify software and device credentials to prevent operator and responder access. Depending on the device, the modification or addition of this password could prevent any device configuration actions from being accomplished and may require a factory reset or replacement of hardware. These credentials are often built-in features provided by the device vendors as a means to restrict access to management interfaces.\n\nAn adversary with access to valid or hardcoded credentials could change the credential to prevent future authorized device access. Change Credential may be especially damaging when paired with other techniques such as Modify Program, Data Destruction, or Modify Controller Tasking. In these cases, a device’s configuration may be destroyed or include malicious actions for the process environment, which cannot not be removed through normal device configuration actions. \n\nAdditionally, recovery of the device and original configuration may be difficult depending on the features provided by the device. In some cases, these passwords cannot be removed onsite and may require that the device be sent back to the vendor for additional recovery steps.\n\n\nA chain of incidents occurred in Germany, where adversaries locked operators out of their building automation system (BAS) controllers by enabling a previously unset BCU key. (Citation: German BAS Lockout Dec 2021) \n\nDetection: Network Traffic Content, Device Alarm\nMitigation: Data Backup, Password Policies, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0892",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "99c0f313-71c0-4660-87bb-2c158684d37b",
    "text": "ID: T0851\nName: Rootkit\nDescription: Adversaries may deploy rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting and modifying operating-system API calls that supply system information. Rootkits or rootkit-enabling functionality may reside at the user or kernel level in the operating system, or lower. (Citation: Enterprise ATT&CK January 2018)   \n\nFirmware rootkits that affect the operating system yield nearly full control of the system. While firmware rootkits are normally developed for the main processing board, they can also be developed for the I/O that is attached to an asset. Compromise of this firmware allows the modification of all of the process variables and functions the module engages in. This may result in commands being disregarded and false information being fed to the main device. By tampering with device processes, an adversary may inhibit its expected response functions and possibly enable [Impact](https://attack.mitre.org/tactics/TA0105).\nDetection: Firmware Modification\nMitigation: Audit, Code Signing",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0851",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "52f629a1-d5dd-4f22-ac21-edcc081e8f9e",
    "text": "ID: T0851\nName: Rootkit\nDescription: Adversaries may deploy rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting and modifying operating-system API calls that supply system information. Rootkits or rootkit-enabling functionality may reside at the user or kernel level in the operating system, or lower. (Citation: Enterprise ATT&CK January 2018)   \n\nFirmware rootkits that affect the operating system yield nearly full control of the system. While firmware rootkits are normally developed for the main processing board, they can also be developed for the I/O that is attached to an asset. Compromise of this firmware allows the modification of all of the process variables and functions the module engages in. This may result in commands being disregarded and false information being fed to the main device. By tampering with device processes, an adversary may inhibit its expected response functions and possibly enable [Impact](https://attack.mitre.org/tactics/TA0105).\nDetection: Firmware Modification\nMitigation: Audit, Code Signing",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0851",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "56de9d57-7478-4f09-a22d-37e560a95772",
    "text": "ID: T0806\nName: Brute Force I/O\nDescription: Adversaries may repetitively or successively change I/O point values to perform an action. Brute Force I/O may be achieved by changing either a range of I/O point values or a single point value repeatedly to manipulate a process function. The adversary's goal and the information they have about the target environment will influence which of the options they choose. In the case of brute forcing a range of point values, the adversary may be able to achieve an impact without targeting a specific point. In the case where a single point is targeted, the adversary may be able to generate instability on the process function associated with that particular point. \n\nAdversaries may use Brute Force I/O to cause failures within various industrial processes. These failures could be the result of wear on equipment or damage to downstream equipment.\nDetection: Application Log Content, Network Traffic Content, Process History/Live Data\nMitigation: Filter Network Traffic, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0806",
      "tactic": "Impair Process Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "1c9cab8c-3c76-4f4f-9450-7d013ccad30e",
    "text": "ID: T0847\nName: Replication Through Removable Media\nDescription: Adversaries may move onto systems, such as those separated from the enterprise network, by copying malware to removable media which is inserted into the control systems environment. The adversary may rely on unknowing trusted third parties, such as suppliers or contractors with access privileges, to introduce the removable media. This technique enables initial access to target devices that never connect to untrusted networks, but are physically accessible.     \n\nOperators of the German nuclear power plant, Gundremmingen, discovered malware on a facility computer not connected to the internet. (Citation: Kernkraftwerk Gundremmingen April 2016) (Citation: Trend Micro April 2016) The malware included Conficker and W32.Ramnit, which were also found on eighteen removable disk drives in the facility. (Citation: Christoph Steitz, Eric Auchard April 2016) (Citation: Catalin Cimpanu April 2016) (Citation: Peter Dockrill April 2016) (Citation: Lee Mathews April 2016) (Citation: Sean Gallagher April 2016) (Citation: Dark Reading Staff April 2016) The plant has since checked for infection and cleaned up more than 1,000 computers. (Citation: BBC April 2016) An ESET researcher commented that internet disconnection does not guarantee system safety from infection or payload execution. (Citation: ESET April 2016)\nDetection: Drive Creation, File Access, File Creation, Process Creation\nMitigation: Disable or Remove Feature or Program, Limit Hardware Installation, Operating System Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0847",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "7b127d69-2422-4294-ab82-96c832e3f6bd",
    "text": "ID: T0830\nName: Adversary-in-the-Middle\nDescription: Adversaries with privileged network access may seek to modify network traffic in real time using adversary-in-the-middle (AiTM) attacks. (Citation: Gabriel Sanchez October 2017) This type of attack allows the adversary to intercept traffic to and/or from a particular device on the network. If a AiTM attack is established, then the adversary has the ability to block, log, modify, or inject traffic into the communication stream. There are several ways to accomplish this attack, but some of the most-common are Address Resolution Protocol (ARP) poisoning and the use of a proxy. (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011)  \n\nAn AiTM attack may allow an adversary to perform the following attacks:  \n[Block Reporting Message](https://attack.mitre.org/techniques/T0804), [Spoof Reporting Message](https://attack.mitre.org/techniques/T0856), [Modify Parameter](https://attack.mitre.org/techniques/T0836), [Unauthorized Command Message](https://attack.mitre.org/techniques/T0855)\nDetection: Application Log Content, Network Traffic Content, Network Traffic Flow, Process Creation, Service Creation, Windows Registry Key Modification\nMitigation: Audit, Communication Authenticity, Disable or Remove Feature or Program, Network Intrusion Prevention, Network Segmentation, Out-of-Band Communications Channel, Software Process and Device Authentication, Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0830",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "b5e2c2e7-f615-4e07-a509-f846488fa13b",
    "text": "ID: T0867\nName: Lateral Tool Transfer\nDescription: Adversaries may transfer tools or other files from one system to another to stage adversary tools or other files over the course of an operation. (Citation: Enterprise ATT&CK) Copying of files may also be performed laterally between internal victim systems to support Lateral Movement with remote Execution using inherent file sharing protocols such as file sharing over SMB to connected network shares. (Citation: Enterprise ATT&CK)\n\nIn control systems environments, malware may use SMB and other file sharing protocols to move laterally through industrial networks.\nDetection: Command Execution, File Creation, File Metadata, Network Share Access, Network Traffic Content, Network Traffic Flow, Process Creation\nMitigation: Network Intrusion Prevention",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0867",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "f0f47500-4028-43df-9e7f-1530833c2802",
    "text": "ID: T0888\nName: Remote System Information Discovery\nDescription: An adversary may attempt to get detailed information about remote systems and their peripherals, such as make/model, role, and configuration. Adversaries may use information from Remote System Information Discovery to aid in targeting and shaping follow-on behaviors. For example, the system's operational role and model information can dictate whether it is a relevant target for the adversary's operational objectives. In addition, the system's configuration may be used to scope subsequent technique usage. \n\nRequests for system information are typically implemented using automation and management protocols and are often automatically requested by vendor software during normal operation. This information may be used to tailor management actions, such as program download and system or module firmware. An adversary may leverage this same information by issuing calls directly to the system's API.\nDetection: File Access, Network Traffic Content, Network Traffic Flow, Process Creation\nMitigation: Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0888",
      "tactic": "Discovery",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "81f25c93-1540-4eaa-a55f-8a6d83ea619e",
    "text": "ID: T0871\nName: Execution through API\nDescription: Adversaries may attempt to leverage Application Program Interfaces (APIs) used for communication between control software and the hardware. Specific functionality is often coded into APIs which can be called by software to engage specific functions on a device or other software.\nDetection: OS API Execution\nMitigation: Access Management, Authorization Enforcement, Execution Prevention, Human User Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0871",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "1ff3f02a-8878-4287-b0a1-3d6d4e17658f",
    "text": "ID: T0826\nName: Loss of Availability\nDescription: Adversaries may attempt to disrupt essential components or systems to prevent owner and operator from delivering products or services. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay) \n\nAdversaries may leverage malware to delete or encrypt critical data on HMIs, workstations, or databases.\n\nIn the 2021 Colonial Pipeline ransomware incident, pipeline operations were temporally halted on May 7th and were not fully restarted until May 12th. (Citation: Colonial Pipeline Company May 2021)\nMitigation: Data Backup, Out-of-Band Communications Channel, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0826",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "71541481-201a-43f7-82a2-8d3eedf9094a",
    "text": "ID: T0840\nName: Network Connection Enumeration\nDescription: Adversaries may perform network connection enumeration to discover information about device communication patterns. If an adversary can inspect the state of a network connection with tools, such as Netstat(Citation: Netstat), in conjunction with [System Firmware](https://attack.mitre.org/techniques/T0857), then they can determine the role of certain devices on the network  (Citation: MITRE). The adversary can also use [Network Sniffing](https://attack.mitre.org/techniques/T0842) to watch network traffic for details about the source, destination, protocol, and content.\nDetection: Command Execution, OS API Execution, Process Creation, Script Execution\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0840",
      "tactic": "Discovery",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "49e33d4d-f4ed-4856-ad92-1ce3bf4d3d2c",
    "text": "ID: T0817\nName: Drive-by Compromise\nDescription: Adversaries may gain access to a system during a drive-by compromise, when a user visits a website as part of a regular browsing session. With this technique, the user's web browser is targeted and exploited simply by visiting the compromised website. \n\nThe adversary may target a specific community, such as trusted third party suppliers or other industry specific groups, which often visit the target website. This kind of targeted attack relies on a common interest, and is known as a strategic web compromise or watering hole attack. \n\nThe National Cyber Awareness System (NCAS) has issued a Technical Alert (TA) regarding Russian government cyber activity targeting critical infrastructure sectors. (Citation: Cybersecurity & Infrastructure Security Agency March 2018) Analysis by DHS and FBI has noted two distinct categories of victims in the Dragonfly campaign on the Western energy sector: staging and intended targets. The adversary targeted the less secure networks of staging targets, including trusted third-party suppliers and related peripheral organizations. Initial access to the intended targets used watering hole attacks to target process control, ICS, and critical infrastructure related trade publications and informational websites.\nDetection: Application Log Content, File Creation, Network Connection Creation, Network Traffic Content, Process Creation\nMitigation: Application Isolation and Sandboxing, Exploit Protection, Restrict Web-Based Content, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0817",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "787c0a2d-a23f-42c8-9a28-1dd48ef41b5f",
    "text": "ID: T0801\nName: Monitor Process State\nDescription: Adversaries may gather information about the physical process state. This information may be used to gain more information about the process itself or used as a trigger for malicious actions. The sources of process state information may vary such as, OPC tags, historian data, specific PLC block information, or network traffic.\nDetection: Application Log Content, Network Traffic Content\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0801",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "67211484-c066-4576-a297-bf7131e6b29b",
    "text": "ID: T0856\nName: Spoof Reporting Message\nDescription: Adversaries may spoof reporting messages in control system environments for evasion and to impair process control. In control systems, reporting messages contain telemetry data (e.g., I/O values) pertaining to the current state of equipment and the industrial process. Reporting messages are important for monitoring the normal operation of a system or identifying important events such as deviations from expected values. \n\nIf an adversary has the ability to Spoof Reporting Messages, they can impact the control system in many ways. The adversary can Spoof Reporting Messages that state that the process is operating normally, as a form of evasion. The adversary could also Spoof Reporting Messages to make the defenders and operators think that other errors are occurring in order to distract them from the actual source of a problem. (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011) \nDetection: Network Traffic Content, Network Traffic Flow, Device Alarm, Windows Registry Key Modification\nMitigation: Communication Authenticity, Filter Network Traffic, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0856",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "56864812-b016-4b24-bd3c-8cb4a897b541",
    "text": "ID: T0856\nName: Spoof Reporting Message\nDescription: Adversaries may spoof reporting messages in control system environments for evasion and to impair process control. In control systems, reporting messages contain telemetry data (e.g., I/O values) pertaining to the current state of equipment and the industrial process. Reporting messages are important for monitoring the normal operation of a system or identifying important events such as deviations from expected values. \n\nIf an adversary has the ability to Spoof Reporting Messages, they can impact the control system in many ways. The adversary can Spoof Reporting Messages that state that the process is operating normally, as a form of evasion. The adversary could also Spoof Reporting Messages to make the defenders and operators think that other errors are occurring in order to distract them from the actual source of a problem. (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011) \nDetection: Network Traffic Content, Network Traffic Flow, Device Alarm, Windows Registry Key Modification\nMitigation: Communication Authenticity, Filter Network Traffic, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0856",
      "tactic": "Impair Process Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5db8529c-0aef-4dbc-8450-15a150d00ef3",
    "text": "ID: T0895\nName: Autorun Image\nDescription: Adversaries may leverage AutoRun functionality or scripts to execute malicious code. Devices configured to enable AutoRun functionality or legacy operating systems may be susceptible to abuse of these features to run malicious code stored on various forms of removeable media (i.e., USB, Disk Images [.ISO]). Commonly, AutoRun or AutoPlay are disabled in many operating systems configurations to mitigate against this technique. If a device is configured to enable AutoRun or AutoPlay, adversaries may execute code on the device by mounting the removable media to the device, either through physical or virtual means. This may be especially relevant for virtual machine environments where disk images may be dynamically mapped to a guest system on a hypervisor.  \n\nAn example could include an adversary gaining access to a hypervisor through the management interface to modify a virtual machine’s hardware configuration. They could then deploy an iso image with a malicious AutoRun script to cause the virtual machine to automatically execute the code contained on the disk image. This would enable the execution of malicious code within a virtual machine without needing any prior remote access to that system.\n\nDetection: Drive Creation, Process Creation\nMitigation: Operating System Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0895",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "86ac85ff-be4e-423a-9810-813124997696",
    "text": "ID: T0883\nName: Internet Accessible Device\nDescription: Adversaries may gain access into industrial environments through systems exposed directly to the internet for remote access rather than through [External Remote Services](https://attack.mitre.org/techniques/T0822). Internet Accessible Devices are exposed to the internet unintentionally or intentionally without adequate protections. This may allow for adversaries to move directly into the control system network. Access onto these devices is accomplished without the use of exploits, these would be represented within the [Exploit Public-Facing Application](https://attack.mitre.org/techniques/T0819) technique.\n\nAdversaries may leverage built in functions for remote access which may not be protected or utilize minimal legacy protections that may be targeted. (Citation: NCCIC January 2014) These services may be discoverable through the use of online scanning tools. \n\nIn the case of the Bowman dam incident, adversaries leveraged access to the dam control network through a cellular modem. Access to the device was protected by password authentication, although the application was vulnerable to brute forcing. (Citation: NCCIC January 2014) (Citation: Danny Yadron December 2015) (Citation: Mark Thompson March 2016)\n\nIn Trend Micros manufacturing deception operations adversaries were detected leveraging direct internet access to an ICS environment through the exposure of operational protocols such as Siemens S7, Omron FINS, and EtherNet/IP, in addition to misconfigured VNC access. (Citation: Stephen Hilt, Federico Maggi, Charles Perine, Lord Remorin, Martin Rsler, and Rainer Vosseler)\nDetection: Logon Session Metadata, Network Traffic Content, Network Traffic Flow\nMitigation: Network Segmentation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0883",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "4a1fe1bf-6fbc-4be4-aa2f-567d32798f58",
    "text": "ID: T0821\nName: Modify Controller Tasking\nDescription: Adversaries may modify the tasking of a controller to allow for the execution of their own programs. This can allow an adversary to manipulate the execution flow and behavior of a controller. \n\nAccording to 61131-3, the association of a Task with a Program Organization Unit (POU) defines a task association. (Citation: IEC February 2013) An adversary may modify these associations or create new ones to manipulate the execution flow of a controller. Modification of controller tasking can be accomplished using a Program Download in addition to other types of program modification such as online edit and program append.\n\nTasks have properties, such as interval, frequency and priority to meet the requirements of program execution. Some controller vendors implement tasks with implicit, pre-defined properties whereas others allow for these properties to be formulated explicitly. An adversary may associate their program with tasks that have a higher priority or execute associated programs more frequently. For instance, to ensure cyclic execution of their program on a Siemens controller, an adversary may add their program to the task, Organization Block 1 (OB1).\nDetection: Application Log Content, Software, Device Alarm\nMitigation: Audit, Authorization Enforcement, Code Signing, Human User Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0821",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "254f6718-2eac-4999-92aa-096a21a53c7d",
    "text": "ID: T0860\nName: Wireless Compromise\nDescription: Adversaries may perform wireless compromise as a method of gaining communications and unauthorized access to a wireless network. Access to a wireless network may be gained through the compromise of a wireless device. (Citation: Alexander Bolshev, Gleb Cherbov July 2014) (Citation: Alexander Bolshev March 2014) Adversaries may also utilize radios and other wireless communication devices on the same frequency as the wireless network. Wireless compromise can be done as an initial access vector from a remote distance. \n\nA Polish student used a modified TV remote controller to gain access to and control over the Lodz city tram system in Poland. (Citation: John Bill May 2017) (Citation: Shelley Smith February 2008) The remote controller device allowed the student to interface with the trams network to modify track settings and override operator control. The adversary may have accomplished this by aligning the controller to the frequency and amplitude of IR control protocol signals. (Citation: Bruce Schneier January 2008) The controller then enabled initial access to the network, allowing the capture and replay of tram signals. (Citation: John Bill May 2017)\nDetection: Application Log Content, Logon Session Creation, Network Traffic Flow\nMitigation: Communication Authenticity, Encrypt Network Traffic, Minimize Wireless Signal Propagation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0860",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "46b92c83-5e5b-4ad9-979e-cd0c9b7d6350",
    "text": "ID: T0837\nName: Loss of Protection\nDescription: Adversaries may compromise protective system functions designed to prevent the effects of faults and abnormal conditions. This can result in equipment damage, prolonged process disruptions and hazards to personnel. \n\nMany faults and abnormal conditions in process control happen too quickly for a human operator to react to. Speed is critical in correcting these conditions to limit serious impacts such as Loss of Control and Property Damage. \n\nAdversaries may target and disable protective system functions as a prerequisite to subsequent attack execution or to allow for future faults and abnormal conditions to go unchecked. Detection of a Loss of Protection by operators can result in the shutdown of a process due to strict policies regarding protection systems. This can cause a Loss of Productivity and Revenue and may meet the technical goals of adversaries seeking to cause process disruptions.",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0837",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "4ca96060-4789-46e7-ba26-4dbbb3b53663",
    "text": "ID: T0836\nName: Modify Parameter\nDescription: Adversaries may modify parameters used to instruct industrial control system devices. These devices operate via programs that dictate how and when to perform actions based on such parameters. Such parameters can determine the extent to which an action is performed and may specify additional options. For example, a program on a control system device dictating motor processes may take a parameter defining the total number of seconds to run that motor.      \n\nAn adversary can potentially modify these parameters to produce an outcome outside of what was intended by the operators. By modifying system and process critical parameters, the adversary may cause [Impact](https://attack.mitre.org/tactics/TA0105) to equipment and/or control processes. Modified parameters may be turned into dangerous, out-of-bounds, or unexpected values from typical operations. For example, specifying that a process run for more or less time than it should, or dictating an unusually high, low, or invalid value as a parameter.\nDetection: Application Log Content, Asset Inventory, Network Traffic Content, Device Alarm\nMitigation: Audit, Authorization Enforcement, Human User Authentication, Validate Program Inputs",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0836",
      "tactic": "Impair Process Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "0a27cb50-4990-4360-9d1e-c0704e1aa3b6",
    "text": "ID: T0861\nName: Point & Tag Identification\nDescription: Adversaries may collect point and tag values to gain a more comprehensive understanding of the process environment. Points may be values such as inputs, memory locations, outputs or other process specific variables. (Citation: Dennis L. Sloatman September 2016) Tags are the identifiers given to points for operator convenience. \n\nCollecting such tags provides valuable context to environmental points and enables an adversary to map inputs, outputs, and other values to their control processes. Understanding the points being collected may inform an adversary on which processes and values to keep track of over the course of an operation.\nDetection: Application Log Content, Network Traffic Content\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0861",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "22893716-8b8b-4f95-bb44-a99448c62b15",
    "text": "ID: T0877\nName: I/O Image\nDescription: Adversaries may seek to capture process values related to the inputs and outputs of a PLC. During the scan cycle, a PLC reads the status of all inputs and stores them in an image table. (Citation: Nanjundaiah, Vaidyanath) The image table is the PLCs internal storage location where values of inputs/outputs for one scan are stored while it executes the user program. After the PLC has solved the entire logic program, it updates the output image table. The contents of this output image table are written to the corresponding output points in I/O Modules.\n\nThe Input and Output Image tables described above make up the I/O Image on a PLC. This image is used by the user program instead of directly interacting with physical I/O. (Citation: Spenneberg, Ralf 2016) \n\nAdversaries may collect the I/O Image state of a PLC by utilizing a devices [Native API](https://attack.mitre.org/techniques/T0834) to access the memory regions directly. The collection of the PLCs I/O state could be used to replace values or inform future stages of an attack.\nDetection: Software\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0877",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5135c882-2e62-498b-a548-87f1cfd86f85",
    "text": "ID: T0820\nName: Exploitation for Evasion\nDescription: Adversaries may exploit a software vulnerability to take advantage of a programming error in a program, service, or within the operating system software or kernel itself to evade detection. Vulnerabilities may exist in software that can be used to disable or circumvent security features.  \n\nAdversaries may have prior knowledge through [Remote System Information Discovery](https://attack.mitre.org/techniques/T0888) about security features implemented on control devices. These device security features will likely be targeted directly for exploitation. There are examples of firmware RAM/ROM consistency checks on control devices being targeted by adversaries to enable the installation of malicious [System Firmware](https://attack.mitre.org/techniques/T0857).\nDetection: Application Log Content\nMitigation: Application Isolation and Sandboxing, Exploit Protection, Threat Intelligence Program, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0820",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "342e4668-9bbf-4fce-8dcc-794cf659f9ed",
    "text": "ID: T0882\nName: Theft of Operational Information\nDescription: Adversaries may steal operational information on a production environment as a direct mission outcome for personal gain or to inform future operations. This information may include design documents, schedules, rotational data, or similar artifacts that provide insight on operations.    In the Bowman Dam incident, adversaries probed systems for operational data. (Citation: Mark Thompson March 2016) (Citation: Danny Yadron December 2015)\nMitigation: Data Loss Prevention, Encrypt Sensitive Information, Operational Information Confidentiality, Restrict File and Directory Permissions",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0882",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "213046e6-cde4-4231-9631-43d4f2416c0c",
    "text": "ID: T0894\nName: System Binary Proxy Execution\nDescription: Adversaries may bypass process and/or signature-based defenses by proxying execution of malicious content with signed, or otherwise trusted, binaries. Binaries used in this technique are often Microsoft-signed files, indicating that they have been either downloaded from Microsoft or are already native in the operating system. (Citation: LOLBAS Project) Binaries signed with trusted digital certificates can typically execute on Windows systems protected by digital signature validation. Several Microsoft signed binaries that are default on Windows installations can be used to proxy execution of other files or commands. Similarly, on Linux systems adversaries may abuse trusted binaries such as split to proxy execution of malicious commands. (Citation: split man page)(Citation: GTFO split)\n\nAdversaries may abuse application binaries installed on a system for proxy execution of malicious code or domain-specific commands. These commands could be used to target local resources on the device or networked devices within the environment through defined APIs ([Execution through API](https://attack.mitre.org/techniques/T0871)) or application-specific programming languages (e.g., MicroSCADA SCIL). Application binaries may be signed by the developer or generally trusted by the operators, analysts, and monitoring tools accustomed to the environment. These applications may be developed and/or directly provided by the device vendor to enable configuration, management, and operation of their devices without many alternatives. \n\nAdversaries may seek to target these trusted application binaries to execute or send commands without the development of custom malware. For example, adversaries may target a SCADA server binary which has the existing ability to send commands to substation devices, such as through IEC 104 command messages. Proxy execution may still require the development of custom tools to hook into the application binary’s execution.\n\n\nDetection: Command Execution, Process Creation, Script Execution\nMitigation: Execution Prevention",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0894",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "a6fff11d-376a-4377-b10b-1d16a81f8d22",
    "text": "ID: T0857\nName: System Firmware\nDescription: System firmware on modern assets is often designed with an update feature. Older device firmware may be factory installed and require special reprograming equipment. When available, the firmware update feature enables vendors to remotely patch bugs and perform upgrades. Device firmware updates are often delegated to the user and may be done using a software update package. It may also be possible to perform this task over the network. \n\nAn adversary may exploit the firmware update feature on accessible devices to upload malicious or out-of-date firmware. Malicious modification of device firmware may provide an adversary with root access to a device, given firmware is one of the lowest programming abstraction layers. (Citation: Basnight, Zachry, et al.)\nDetection: Application Log Content, Firmware Modification, Network Traffic Content, Device Alarm\nMitigation: Access Management, Audit, Boot Integrity, Code Signing, Communication Authenticity, Encrypt Network Traffic, Encrypt Sensitive Information, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0857",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "28010173-9a1a-4e63-a533-06343118c569",
    "text": "ID: T0857\nName: System Firmware\nDescription: System firmware on modern assets is often designed with an update feature. Older device firmware may be factory installed and require special reprograming equipment. When available, the firmware update feature enables vendors to remotely patch bugs and perform upgrades. Device firmware updates are often delegated to the user and may be done using a software update package. It may also be possible to perform this task over the network. \n\nAn adversary may exploit the firmware update feature on accessible devices to upload malicious or out-of-date firmware. Malicious modification of device firmware may provide an adversary with root access to a device, given firmware is one of the lowest programming abstraction layers. (Citation: Basnight, Zachry, et al.)\nDetection: Application Log Content, Firmware Modification, Network Traffic Content, Device Alarm\nMitigation: Access Management, Audit, Boot Integrity, Code Signing, Communication Authenticity, Encrypt Network Traffic, Encrypt Sensitive Information, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0857",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5a56e4f6-976c-447b-ade5-4b3054f1f24c",
    "text": "ID: T0800\nName: Activate Firmware Update Mode\nDescription: Adversaries may activate firmware update mode on devices to prevent expected response functions from engaging in reaction to an emergency or process malfunction. For example, devices such as protection relays may have an operation mode designed for firmware installation. This mode may halt process monitoring and related functions to allow new firmware to be loaded. A device left in update mode may be placed in an inactive holding state if no firmware is provided to it. By entering and leaving a device in this mode, the adversary may deny its usual functionalities.\nDetection: Application Log Content, Network Traffic Content, Device Alarm\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0800",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "9e4c24b5-32c0-4c3a-85b0-4d85acf4e8b4",
    "text": "ID: T0816\nName: Device Restart/Shutdown\nDescription: Adversaries may forcibly restart or shutdown a device in an ICS environment to disrupt and potentially negatively impact physical processes. Methods of device restart and shutdown exist in some devices as built-in, standard functionalities. These functionalities can be executed using interactive device web interfaces, CLIs, and network protocol commands.\n\nUnexpected restart or shutdown of control system devices may prevent expected response functions happening during critical states.\n\nA device restart can also be a sign of malicious device modifications, as many updates require a shutdown in order to take effect.\nDetection: Application Log Content, Network Traffic Content, Network Traffic Flow, Device Alarm\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Disable or Remove Feature or Program, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0816",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "eb399245-7d76-4ac3-8e90-05af44a4954b",
    "text": "ID: T0839\nName: Module Firmware\nDescription: Adversaries may install malicious or vulnerable firmware onto modular hardware devices. Control system devices often contain modular hardware devices. These devices may have their own set of firmware that is separate from the firmware of the main control system equipment.   \n\nThis technique is similar to [System Firmware](https://attack.mitre.org/techniques/T0857), but is conducted on other system components that may not have the same capabilities or level of integrity checking. Although it results in a device re-image, malicious device firmware may provide persistent access to remaining devices. (Citation: Daniel Peck,  Dale Peterson January 2009)  \n\nAn easy point of access for an adversary is the Ethernet card, which may have its own CPU, RAM, and operating system. The adversary may attack and likely exploit the computer on an Ethernet card. Exploitation of the Ethernet card computer may enable the adversary to accomplish additional attacks, such as the following: (Citation: Daniel Peck,  Dale Peterson January 2009)  \n\n* Delayed Attack - The adversary may stage an attack in advance and choose when to launch it, such as at a particularly damaging time.  \n* Brick the Ethernet Card - Malicious firmware may be programmed to result in an Ethernet card failure, requiring a factory return.  \n* Random Attack or Failure - The adversary may load malicious firmware onto multiple field devices. Execution of an attack and the time it occurs is generated by a pseudo-random number generator.   \n* A Field Device Worm - The adversary may choose to identify all field devices of the same model, with the end goal of performing a device-wide compromise.  \n* Attack Other Cards on the Field Device - Although it is not the most important module in a field device, the Ethernet card is most accessible to the adversary and malware. Compromise of the Ethernet card may provide a more direct route to compromising other modules, such as the CPU module.\nDetection: Application Log Content, Firmware Modification, Network Traffic Content, Device Alarm\nMitigation: Access Management, Audit, Boot Integrity, Code Signing, Communication Authenticity, Encrypt Network Traffic, Encrypt Sensitive Information, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0839",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "9fe53ee6-b7ca-4612-b972-96cb824e328a",
    "text": "ID: T0839\nName: Module Firmware\nDescription: Adversaries may install malicious or vulnerable firmware onto modular hardware devices. Control system devices often contain modular hardware devices. These devices may have their own set of firmware that is separate from the firmware of the main control system equipment.   \n\nThis technique is similar to [System Firmware](https://attack.mitre.org/techniques/T0857), but is conducted on other system components that may not have the same capabilities or level of integrity checking. Although it results in a device re-image, malicious device firmware may provide persistent access to remaining devices. (Citation: Daniel Peck,  Dale Peterson January 2009)  \n\nAn easy point of access for an adversary is the Ethernet card, which may have its own CPU, RAM, and operating system. The adversary may attack and likely exploit the computer on an Ethernet card. Exploitation of the Ethernet card computer may enable the adversary to accomplish additional attacks, such as the following: (Citation: Daniel Peck,  Dale Peterson January 2009)  \n\n* Delayed Attack - The adversary may stage an attack in advance and choose when to launch it, such as at a particularly damaging time.  \n* Brick the Ethernet Card - Malicious firmware may be programmed to result in an Ethernet card failure, requiring a factory return.  \n* Random Attack or Failure - The adversary may load malicious firmware onto multiple field devices. Execution of an attack and the time it occurs is generated by a pseudo-random number generator.   \n* A Field Device Worm - The adversary may choose to identify all field devices of the same model, with the end goal of performing a device-wide compromise.  \n* Attack Other Cards on the Field Device - Although it is not the most important module in a field device, the Ethernet card is most accessible to the adversary and malware. Compromise of the Ethernet card may provide a more direct route to compromising other modules, such as the CPU module.\nDetection: Application Log Content, Firmware Modification, Network Traffic Content, Device Alarm\nMitigation: Access Management, Audit, Boot Integrity, Code Signing, Communication Authenticity, Encrypt Network Traffic, Encrypt Sensitive Information, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0839",
      "tactic": "Impair Process Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "44c6667c-8c92-4853-9b2d-53e916c2e1f6",
    "text": "ID: T0881\nName: Service Stop\nDescription: Adversaries may stop or disable services on a system to render those services unavailable to legitimate users. Stopping critical services can inhibit or stop response to an incident or aid in the adversary's overall objectives to cause damage to the environment. (Citation: Enterprise ATT&CK)  Services may not allow for modification of their data stores while running. Adversaries may stop services in order to conduct Data Destruction. (Citation: Enterprise ATT&CK)\nDetection: Command Execution, File Modification, OS API Execution, Process Creation, Process Termination, Service Metadata, Windows Registry Key Modification\nMitigation: Network Segmentation, Restrict File and Directory Permissions, Restrict Registry Permissions, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0881",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "09506b7b-628c-4233-845c-03b4bfc69dbc",
    "text": "ID: T0878\nName: Alarm Suppression\nDescription: Adversaries may target protection function alarms to prevent them from notifying operators of critical conditions. Alarm messages may be a part of an overall reporting system and of particular interest for adversaries. Disruption of the alarm system does not imply the disruption of the reporting system as a whole.\n\nA Secura presentation on targeting OT notes a dual fold goal for adversaries attempting alarm suppression: prevent outgoing alarms from being raised and prevent incoming alarms from being responded to. (Citation: Jos Wetzels, Marina Krotofil 2019) The method of suppression may greatly depend on the type of alarm in question:  \n\n* An alarm raised by a protocol message \n* An alarm signaled with I/O \n* An alarm bit set in a flag (and read) \n\nIn ICS environments, the adversary may have to suppress or contend with multiple alarms and/or alarm propagation to achieve a specific goal to evade detection or prevent intended responses from occurring. (Citation: Jos Wetzels, Marina Krotofil 2019)  Methods of suppression may involve tampering or altering device displays and logs, modifying in memory code to fixed values, or even tampering with assembly level instruction code.\nDetection: Network Traffic Flow, Device Alarm, Process History/Live Data, Process/Event Alarm\nMitigation: Network Allowlists, Network Segmentation, Out-of-Band Communications Channel, Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0878",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "0c1ea12d-8ca0-4db5-a7bf-795ab988f6e7",
    "text": "ID: T0803\nName: Block Command Message\nDescription: Adversaries may block a command message from reaching its intended target to prevent command execution. In OT networks, command messages are sent to provide instructions to control system devices. A blocked command message can inhibit response functions from correcting a disruption or unsafe condition. (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011)  (Citation: Electricity Information Sharing and Analysis Center; SANS Industrial Control Systems March 2016)\nDetection: Application Log Content, Network Traffic Flow, Process History/Live Data, Process/Event Alarm, Process Termination\nMitigation: Network Allowlists, Out-of-Band Communications Channel, Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0803",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "6b3cccc4-d168-461d-8cc8-8e0ff6a3f94e",
    "text": "ID: T0815\nName: Denial of View\nDescription: Adversaries may cause a denial of view in attempt to disrupt and prevent operator oversight on the status of an ICS environment. This may manifest itself as a temporary communication failure between a device and its control source, where the interface recovers and becomes available once the interference ceases. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay) \n\nAn adversary may attempt to deny operator visibility by preventing them from receiving status and reporting messages. Denying this view may temporarily block and prevent operators from noticing a change in state or anomalous behavior. The environment's data and processes may still be operational, but functioning in an unintended or adversarial manner. \nMitigation: Data Backup, Out-of-Band Communications Channel, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0815",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "7865b9a1-9e5e-4975-9290-bdc871939b61",
    "text": "ID: T0842\nName: Network Sniffing\nDescription: Network sniffing is the practice of using a network interface on a computer system to monitor or capture information (Citation: Enterprise ATT&CK January 2018) regardless of whether it is the specified destination for the information. \n\nAn adversary may attempt to sniff the traffic to gain information about the target. This information can vary in the level of importance. Relatively unimportant information is general communications to and from machines.  Relatively important information would be login information. User credentials may be sent over an unencrypted protocol, such as Telnet, that can be captured and obtained through network packet analysis. \n\nIn addition, ARP and Domain Name Service (DNS) poisoning can be used to capture credentials to websites, proxies, and internal systems by redirecting traffic to an adversary.\nDetection: Command Execution, Process Creation\nMitigation: Encrypt Network Traffic, Multi-factor Authentication, Network Segmentation, Privileged Account Management, Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0842",
      "tactic": "Discovery",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "3ca59984-9531-4a91-a1f6-36af109bac42",
    "text": "ID: T0835\nName: Manipulate I/O Image\nDescription: Adversaries may manipulate the I/O image of PLCs through various means to prevent them from functioning as expected. Methods of I/O image manipulation may include overriding the I/O table via direct memory manipulation or using the override function used for testing PLC programs. (Citation: Dr. Kelvin T. Erickson December 2010) During the scan cycle, a PLC reads the status of all inputs and stores them in an image table. (Citation: Nanjundaiah, Vaidyanath) The image table is the PLCs internal storage location where values of inputs/outputs for one scan are stored while it executes the user program. After the PLC has solved the entire logic program, it updates the output image table. The contents of this output image table are written to the corresponding output points in I/O Modules. \n\nOne of the unique characteristics of PLCs is their ability to override the status of a physical discrete input or to override the logic driving a physical output coil and force the output to a desired status.\nDetection: Software\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0835",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "7e6316f7-8704-47e7-a68e-ac8658258a44",
    "text": "ID: T0862\nName: Supply Chain Compromise\nDescription: Adversaries may perform supply chain compromise to gain control systems environment access by means of infected products, software, and workflows. Supply chain compromise is the manipulation of products, such as devices or software, or their delivery mechanisms before receipt by the end consumer. Adversary compromise of these products and mechanisms is done for the goal of data or system compromise, once infected products are introduced to the target environment. \n\nSupply chain compromise can occur at all stages of the supply chain, from manipulation of development tools and environments to manipulation of developed products and tools distribution mechanisms. This may involve the compromise and replacement of legitimate software and patches, such as on third party or vendor websites. Targeting of supply chain compromise can be done in attempts to infiltrate the environments of a specific audience. In control systems environments with assets in both the IT and OT networks, it is possible a supply chain compromise affecting the IT environment could enable further access to the OT environment.   \n\nCounterfeit devices may be introduced to the global supply chain posing safety and cyber risks to asset owners and operators. These devices may not meet the safety, engineering and manufacturing requirements of regulatory bodies but may feature tagging indicating conformance with industry standards. Due to the lack of adherence to standards and overall lesser quality, the counterfeit products may pose a serious safety and operational risk. (Citation: Control Global May 2019) \n\nYokogawa identified instances in which their customers received counterfeit differential pressure transmitters using the Yokogawa logo. The counterfeit transmitters were nearly indistinguishable with a semblance of functionality and interface that mimics the genuine product. (Citation: Control Global May 2019) \n\nF-Secure Labs analyzed the approach the adversary used to compromise victim systems with Havex. (Citation: Daavid Hentunen, Antti Tikkanen June 2014) The adversary planted trojanized software installers available on legitimate ICS/SCADA vendor websites. After being downloaded, this software infected the host computer with a Remote Access Trojan (RAT).\nDetection: File Metadata\nMitigation: Audit, Code Signing, Supply Chain Management, Update Software, Vulnerability Scanning",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0862",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "c23c81f9-b78c-416e-bf44-da6fce8360aa",
    "text": "ID: T0874\nName: Hooking\nDescription: Adversaries may hook into application programming interface (API) functions used by processes to redirect calls for execution and privilege escalation means. Windows processes often leverage these API functions to perform tasks that require reusable system resources. Windows API functions are typically stored in dynamic-link libraries (DLLs) as exported functions. (Citation: Enterprise ATT&CK)\n\nOne type of hooking seen in ICS involves redirecting calls to these functions via import address table (IAT) hooking. IAT hooking uses modifications to a process IAT, where pointers to imported API functions are stored. (Citation: Nicolas Falliere, Liam O Murchu, Eric Chien February 2011)\nDetection: OS API Execution, Process Metadata\nMitigation: Audit, Restrict Library Loading",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0874",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5b862fe2-b755-4f17-9a8a-0310b7228342",
    "text": "ID: T0874\nName: Hooking\nDescription: Adversaries may hook into application programming interface (API) functions used by processes to redirect calls for execution and privilege escalation means. Windows processes often leverage these API functions to perform tasks that require reusable system resources. Windows API functions are typically stored in dynamic-link libraries (DLLs) as exported functions. (Citation: Enterprise ATT&CK)\n\nOne type of hooking seen in ICS involves redirecting calls to these functions via import address table (IAT) hooking. IAT hooking uses modifications to a process IAT, where pointers to imported API functions are stored. (Citation: Nicolas Falliere, Liam O Murchu, Eric Chien February 2011)\nDetection: OS API Execution, Process Metadata\nMitigation: Audit, Restrict Library Loading",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0874",
      "tactic": "Privilege Escalation",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "2e16a3d4-4f1b-4940-a7cf-833b622d054a",
    "text": "ID: T0823\nName: Graphical User Interface\nDescription: Adversaries may attempt to gain access to a machine via a Graphical User Interface (GUI) to enhance execution capabilities. Access to a GUI allows a user to interact with a computer in a more visual manner than a CLI. A GUI allows users to move a cursor and click on interface objects, with a mouse and keyboard as the main input devices, as opposed to just using the keyboard.\n\nIf physical access is not an option, then access might be possible via protocols such as VNC on Linux-based and Unix-based operating systems, and RDP on Windows operating systems. An adversary can use this access to execute programs and applications on the target machine.\nDetection: Command Execution, Logon Session Creation, Module Load, Process Creation\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0823",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "f54a3293-38dd-4af4-b825-15da723dedc1",
    "text": "ID: T0858\nName: Change Operating Mode\nDescription: Adversaries may change the operating mode of a controller to gain additional access to engineering functions such as Program Download.   Programmable controllers typically have several modes of operation that control the state of the user program and control access to the controllers API. Operating modes can be physically selected using a key switch on the face of the controller but may also be selected with calls to the controllers API. Operating modes and the mechanisms by which they are selected often vary by vendor and product line. Some commonly implemented operating modes are described below:  \n\n* Program - This mode must be enabled before changes can be made to a devices program. This allows program uploads and downloads between the device and an engineering workstation. Often the PLCs logic Is halted, and all outputs may be forced off. (Citation: N.A. October 2017)  \n* Run - Execution of the devices program occurs in this mode. Input and output (values, points, tags, elements, etc.) are monitored and used according to the programs logic. [Program Upload](https://attack.mitre.org/techniques/T0845) and [Program Download](https://attack.mitre.org/techniques/T0843) are disabled while in this mode. (Citation: Omron) (Citation: Machine Information Systems 2007)  (Citation: N.A. October 2017) (Citation: PLCgurus 2021)   \n* Remote - Allows for remote changes to a PLCs operation mode. (Citation: PLCgurus 2021)    \n* Stop - The PLC and program is stopped, while in this mode, outputs are forced off. (Citation: Machine Information Systems 2007)   \n* Reset - Conditions on the PLC are reset to their original states. Warm resets may retain some memory while cold resets will reset all I/O and data registers. (Citation: Machine Information Systems 2007)   \n* Test / Monitor mode - Similar to run mode, I/O is processed, although this mode allows for monitoring, force set, resets, and more generally tuning or debugging of the system. Often monitor mode may be used as a trial for initialization. (Citation: Omron)\nDetection: Application Log Content, Network Traffic Content, Device Alarm\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0858",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "c750b9bd-b797-4d71-be91-2e1f86e8e068",
    "text": "ID: T0858\nName: Change Operating Mode\nDescription: Adversaries may change the operating mode of a controller to gain additional access to engineering functions such as Program Download.   Programmable controllers typically have several modes of operation that control the state of the user program and control access to the controllers API. Operating modes can be physically selected using a key switch on the face of the controller but may also be selected with calls to the controllers API. Operating modes and the mechanisms by which they are selected often vary by vendor and product line. Some commonly implemented operating modes are described below:  \n\n* Program - This mode must be enabled before changes can be made to a devices program. This allows program uploads and downloads between the device and an engineering workstation. Often the PLCs logic Is halted, and all outputs may be forced off. (Citation: N.A. October 2017)  \n* Run - Execution of the devices program occurs in this mode. Input and output (values, points, tags, elements, etc.) are monitored and used according to the programs logic. [Program Upload](https://attack.mitre.org/techniques/T0845) and [Program Download](https://attack.mitre.org/techniques/T0843) are disabled while in this mode. (Citation: Omron) (Citation: Machine Information Systems 2007)  (Citation: N.A. October 2017) (Citation: PLCgurus 2021)   \n* Remote - Allows for remote changes to a PLCs operation mode. (Citation: PLCgurus 2021)    \n* Stop - The PLC and program is stopped, while in this mode, outputs are forced off. (Citation: Machine Information Systems 2007)   \n* Reset - Conditions on the PLC are reset to their original states. Warm resets may retain some memory while cold resets will reset all I/O and data registers. (Citation: Machine Information Systems 2007)   \n* Test / Monitor mode - Similar to run mode, I/O is processed, although this mode allows for monitoring, force set, resets, and more generally tuning or debugging of the system. Often monitor mode may be used as a trial for initialization. (Citation: Omron)\nDetection: Application Log Content, Network Traffic Content, Device Alarm\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0858",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "4b9a55d9-0bfb-46da-b217-75fd26ac0f25",
    "text": "ID: T0819\nName: Exploit Public-Facing Application\nDescription: Adversaries may leverage weaknesses to exploit internet-facing software for initial access into an industrial network. Internet-facing software may be user applications, underlying networking implementations, an assets operating system, weak defenses, etc. Targets of this technique may be intentionally exposed for the purpose of remote management and visibility.\n\nAn adversary may seek to target public-facing applications as they may provide direct access into an ICS environment or the ability to move into the ICS network. Publicly exposed applications may be found through online tools that scan the internet for open ports and services. Version numbers for the exposed application may provide adversaries an ability to target specific known vulnerabilities. Exposed control protocol or remote access ports found in Commonly Used Port may be of interest by adversaries.\nDetection: Application Log Content, Network Traffic Content\nMitigation: Application Isolation and Sandboxing, Exploit Protection, Network Segmentation, Privileged Account Management, Update Software, Vulnerability Scanning",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0819",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "e032005d-6be1-4ac8-8e10-141c99ff007b",
    "text": "ID: T0859\nName: Valid Accounts\nDescription: Adversaries may steal the credentials of a specific user or service account using credential access techniques. In some cases, default credentials for control system devices may be publicly available. Compromised credentials may be used to bypass access controls placed on various resources on hosts and within the network, and may even be used for persistent access to remote systems. Compromised and default credentials may also grant an adversary increased privilege to specific systems and devices or access to restricted areas of the network. Adversaries may choose not to use malware or tools, in conjunction with the legitimate access those credentials provide, to make it harder to detect their presence or to control devices and send legitimate commands in an unintended way. \n\nAdversaries may also create accounts, sometimes using predefined account names and passwords, to provide a means of backup access for persistence. (Citation: Booz Allen Hamilton) \n\nThe overlap of credentials and permissions across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator)  and possibly between the enterprise and operational technology environments. Adversaries may be able to leverage valid credentials from one system to gain access to another system.\nDetection: Logon Session Creation, Logon Session Metadata, User Account Authentication\nMitigation: Access Management, Account Use Policies, Active Directory Configuration, Application Developer Guidance, Audit, Filter Network Traffic, Multi-factor Authentication, Password Policies, Privileged Account Management, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0859",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5b704474-0acc-4c6a-9618-b3b61f933137",
    "text": "ID: T0859\nName: Valid Accounts\nDescription: Adversaries may steal the credentials of a specific user or service account using credential access techniques. In some cases, default credentials for control system devices may be publicly available. Compromised credentials may be used to bypass access controls placed on various resources on hosts and within the network, and may even be used for persistent access to remote systems. Compromised and default credentials may also grant an adversary increased privilege to specific systems and devices or access to restricted areas of the network. Adversaries may choose not to use malware or tools, in conjunction with the legitimate access those credentials provide, to make it harder to detect their presence or to control devices and send legitimate commands in an unintended way. \n\nAdversaries may also create accounts, sometimes using predefined account names and passwords, to provide a means of backup access for persistence. (Citation: Booz Allen Hamilton) \n\nThe overlap of credentials and permissions across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator)  and possibly between the enterprise and operational technology environments. Adversaries may be able to leverage valid credentials from one system to gain access to another system.\nDetection: Logon Session Creation, Logon Session Metadata, User Account Authentication\nMitigation: Access Management, Account Use Policies, Active Directory Configuration, Application Developer Guidance, Audit, Filter Network Traffic, Multi-factor Authentication, Password Policies, Privileged Account Management, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0859",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "ad004e7c-f47b-462e-9acc-32ae48c71ab0",
    "text": "ID: T0822\nName: External Remote Services\nDescription: Adversaries may leverage external remote services as a point of initial access into your network. These services allow users to connect to internal network resources from external locations. Examples are VPNs, Citrix, and other access mechanisms. Remote service gateways often manage connections and credential authentication for these services. (Citation: Daniel Oakley, Travis Smith, Tripwire)\n\nExternal remote services allow administration of a control system from outside the system. Often, vendors and internal engineering groups have access to external remote services to control system networks via the corporate network. In some cases, this access is enabled directly from the internet. While remote access enables ease of maintenance when a control system is in a remote area, compromise of remote access solutions is a liability. The adversary may use these services to gain access to and execute attacks against a control system network. Access to valid accounts is often a requirement. \n\nAs they look for an entry point into the control system network, adversaries may begin searching for existing point-to-point VPN implementations at trusted third party networks or through remote support employee connections where split tunneling is enabled. (Citation: Electricity Information Sharing and Analysis Center; SANS Industrial Control Systems March 2016)\n\nDetection: Application Log Content, Logon Session Metadata, Network Traffic Flow\nMitigation: Account Use Policies, Disable or Remove Feature or Program, Limit Access to Resource Over Network, Multi-factor Authentication, Network Segmentation, Password Policies, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0822",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "6e3ace68-eb48-4418-94ab-c0a042b9b66d",
    "text": "ID: T0863\nName: User Execution\nDescription: Adversaries may rely on a targeted organizations user interaction for the execution of malicious code. User interaction may consist of installing applications, opening email attachments, or granting higher permissions to documents. \n\nAdversaries may embed malicious code or visual basic code into files such as Microsoft Word and Excel documents or software installers. (Citation: Booz Allen Hamilton) Execution of this code requires that the user enable scripting or write access within the document. Embedded code may not always be noticeable to the user especially in cases of trojanized software. (Citation: Daavid Hentunen, Antti Tikkanen June 2014) \n\nA Chinese spearphishing campaign running from December 9, 2011 through February 29, 2012 delivered malware through spearphishing attachments which required user action to achieve execution. (Citation: CISA AA21-201A Pipeline Intrusion July 2021)\nDetection: Application Log Content, Command Execution, File Access, Network Connection Creation, Network Traffic Content, Process Creation\nMitigation: Antivirus/Antimalware, Code Signing, Execution Prevention, Network Intrusion Prevention, Restrict Web-Based Content, User Training",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0863",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "a10067ea-41b2-49d9-aaa2-417e39b4037d",
    "text": "ID: T0834\nName: Native API\nDescription: Adversaries may directly interact with the native OS application programming interface (API) to access system functions. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. (Citation: The MITRE Corporation May 2017) These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations. \n\nFunctionality provided by native APIs are often also exposed to user-mode applications via interfaces and libraries. For example, functions such as memcpy and direct operations on memory registers can be used to modify user and system memory space.\nDetection: OS API Execution\nMitigation: Execution Prevention",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0834",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "2663aa11-73c5-4a03-ae65-c31d04051bd4",
    "text": "ID: T0843\nName: Program Download\nDescription: Adversaries may perform a program download to transfer a user program to a controller. \n\nVariations of program download, such as online edit and program append, allow a controller to continue running during the transfer and reconfiguration process without interruption to process control. However, before starting a full program download (i.e., download all) a controller may need to go into a stop state. This can have negative consequences on the physical process, especially if the controller is not able to fulfill a time-sensitive action. Adversaries may choose to avoid a download all in favor of an online edit or program append to avoid disrupting the physical process. An adversary may need to use the technique Detect Operating Mode or Change Operating Mode to make sure the controller is in the proper mode to accept a program download.\n\nThe granularity of control to transfer a user program in whole or parts is dictated by the management protocol (e.g., S7CommPlus, TriStation) and underlying controller API. Thus, program download is a high-level term for the suite of vendor-specific API calls used to configure a controllers user program memory space.  \n\n[Modify Controller Tasking](https://attack.mitre.org/techniques/T0821) and [Modify Program](https://attack.mitre.org/techniques/T0889) represent the configuration changes that are transferred to a controller via a program download.\nDetection: Application Log Content, Asset Inventory, Network Traffic Content, Device Alarm\nMitigation: Access Management, Audit, Authorization Enforcement, Code Signing, Communication Authenticity, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0843",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "680eafba-bb81-447e-b719-56919231fb51",
    "text": "ID: T0814\nName: Denial of Service\nDescription: Adversaries may perform Denial-of-Service (DoS) attacks to disrupt expected device functionality. Examples of DoS attacks include overwhelming the target device with a high volume of requests in a short time period and sending the target device a request it does not know how to handle. Disrupting device state may temporarily render it unresponsive, possibly lasting until a reboot can occur. When placed in this state, devices may be unable to send and receive requests, and may not perform expected response functions in reaction to other events in the environment. \n\nSome ICS devices are particularly sensitive to DoS events, and may become unresponsive in reaction to even a simple ping sweep. Adversaries may also attempt to execute a Permanent Denial-of-Service (PDoS) against certain devices, such as in the case of the BrickerBot malware. (Citation: ICS-CERT April 2017) \n\nAdversaries may exploit a software vulnerability to cause a denial of service by taking advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Vulnerabilities may exist in software that can be used to cause a denial of service condition. \n\nAdversaries may have prior knowledge about industrial protocols or control devices used in the environment through [Remote System Information Discovery](https://attack.mitre.org/techniques/T0888). There are examples of adversaries remotely causing a [Device Restart/Shutdown](https://attack.mitre.org/techniques/T0816) by exploiting a vulnerability that induces uncontrolled resource consumption. (Citation: ICS-CERT August 2018) (Citation: Common Weakness Enumeration January 2019) (Citation: MITRE March 2018) \nDetection: Application Log Content, Network Traffic Content, Network Traffic Flow, Process History/Live Data\nMitigation: Watchdog Timers",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0814",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "420e9e26-3ab7-46d2-b275-00ca2c6725aa",
    "text": "ID: T0802\nName: Automated Collection\nDescription: Adversaries may automate collection of industrial environment information using tools or scripts. This automated collection may leverage native control protocols and tools available in the control systems environment. For example, the OPC protocol may be used to enumerate and gather information. Access to a system or interface with these native protocols may allow collection and enumeration of other attached, communicating servers and devices.\nDetection: Command Execution, File Access, Network Traffic Content, Script Execution\nMitigation: Network Allowlists, Network Segmentation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0802",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "b7693110-0f45-4a35-a367-268a56a61f3f",
    "text": "ID: T0855\nName: Unauthorized Command Message\nDescription: Adversaries may send unauthorized command messages to instruct control system assets to perform actions outside of their intended functionality, or without the logical preconditions to trigger their expected function. Command messages are used in ICS networks to give direct instructions to control systems devices. If an adversary can send an unauthorized command message to a control system, then it can instruct the control systems device to perform an action outside the normal bounds of the device's actions. An adversary could potentially instruct a control systems device to perform an action that will cause an [Impact](https://attack.mitre.org/tactics/TA0105). (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011)\n\nIn the Dallas Siren incident, adversaries were able to send command messages to activate tornado alarm systems across the city without an impending tornado or other disaster. (Citation: Zack Whittaker April 2017) (Citation: Benjamin Freed March 2019)\nDetection: Application Log Content, Network Traffic Content, Network Traffic Flow, Process History/Live Data, Process/Event Alarm\nMitigation: Communication Authenticity, Filter Network Traffic, Network Allowlists, Network Segmentation, Software Process and Device Authentication, Validate Program Inputs",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0855",
      "tactic": "Impair Process Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "ef0f01c2-a1dc-46fc-a17e-b59664c9b7e4",
    "text": "ID: T0879\nName: Damage to Property\nDescription: Adversaries may cause damage and destruction of property to infrastructure, equipment, and the surrounding environment when attacking control systems. This technique may result in device and operational equipment breakdown, or represent tangential damage from other techniques used in an attack. Depending on the severity of physical damage and disruption caused to control processes and systems, this technique may result in [Loss of Safety](https://attack.mitre.org/techniques/T0880). Operations that result in [Loss of Control](https://attack.mitre.org/techniques/T0827) may also cause damage to property, which may be directly or indirectly motivated by an adversary seeking to cause impact in the form of [Loss of Productivity and Revenue](https://attack.mitre.org/techniques/T0828). \n\n\nThe German Federal Office for Information Security (BSI) reported a targeted attack on a steel mill under an incidents affecting business section of its 2014 IT Security Report. (Citation: BSI State of IT Security 2014)  These targeted attacks affected industrial operations and resulted in breakdowns of control system components and even entire installations. As a result of these breakdowns, massive impact and damage resulted from the uncontrolled shutdown of a blast furnace. \n\nA Polish student used a remote controller device to interface with the Lodz city tram system in Poland. (Citation: John Bill May 2017) (Citation: Shelley Smith February 2008) (Citation: Bruce Schneier January 2008) Using this remote, the student was able to capture and replay legitimate tram signals. This resulted in damage to impacted trams, people, and the surrounding property. Reportedly, four trams were derailed and were forced to make emergency stops. (Citation: Shelley Smith February 2008) Commands issued by the student may have also resulted in tram collisions, causing harm to those on board and the environment outside. (Citation: Bruce Schneier January 2008)\nMitigation: Mechanical Protection Layers, Network Allowlists, Safety Instrumented Systems",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0879",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "74bd0e13-2ae9-4eb7-b542-e5a1eb46a1e3",
    "text": "ID: T0880\nName: Loss of Safety\nDescription: Adversaries may compromise safety system functions designed to maintain safe operation of a process when unacceptable or dangerous conditions occur. Safety systems are often composed of the same elements as control systems but have the sole purpose of ensuring the process fails in a predetermined safe manner. \n\nMany unsafe conditions in process control happen too quickly for a human operator to react to. Speed is critical in correcting these conditions to limit serious impacts such as Loss of Control and Property Damage. \n\nAdversaries may target and disable safety system functions as a prerequisite to subsequent attack execution or to allow for future unsafe conditionals to go unchecked. Detection of a Loss of Safety by operators can result in the shutdown of a process due to strict policies regarding safety systems. This can cause a Loss of Productivity and Revenue and may meet the technical goals of adversaries seeking to cause process disruptions.\nMitigation: Mechanical Protection Layers, Safety Instrumented Systems",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0880",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "90ba3622-a68d-452c-a5bb-692e3fb955f9",
    "text": "ID: T0838\nName: Modify Alarm Settings\nDescription: Adversaries may modify alarm settings to prevent alerts that may inform operators of their presence or to prevent responses to dangerous and unintended scenarios. Reporting messages are a standard part of data acquisition in control systems. Reporting messages are used as a way to transmit system state information and acknowledgements that specific actions have occurred. These messages provide vital information for the management of a physical process, and keep operators, engineers, and administrators aware of the state of system devices and physical processes. \n\nIf an adversary is able to change the reporting settings, certain events could be prevented from being reported. This type of modification can also prevent operators or devices from performing actions to keep the system in a safe state. If critical reporting messages cannot trigger these actions then a [Impact](https://attack.mitre.org/tactics/TA0105) could occur. \n\nIn ICS environments, the adversary may have to use [Alarm Suppression](https://attack.mitre.org/techniques/T0878) or contend with multiple alarms and/or alarm propagation to achieve a specific goal to evade detection or prevent intended responses from occurring. (Citation: Jos Wetzels, Marina Krotofil 2019)  Methods of suppression often rely on modification of alarm settings, such as modifying in memory code to fixed values or tampering with assembly level instruction code. \nDetection: Application Log Content, Asset Inventory, Network Traffic Content, Process History/Live Data\nMitigation: Access Management, Authorization Enforcement, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0838",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "1fc976f5-4b7b-4122-ad6e-6c70c5c6ae38",
    "text": "ID: T0864\nName: Transient Cyber Asset\nDescription: Adversaries may target devices that are transient across ICS networks and external networks. Normally, transient assets are brought into an environment by authorized personnel and do not remain in that environment on a permanent basis. (Citation: North American Electric Reliability Corporation June 2021) Transient assets are commonly needed to support management functions and may be more common in systems where a remotely managed asset is not feasible, external connections for remote access do not exist, or 3rd party contractor/vendor access is required. \n\nAdversaries may take advantage of transient assets in different ways. For instance, adversaries may target a transient asset when it is connected to an external network and then leverage its trusted access in another environment to launch an attack. They may also take advantage of installed applications and libraries that are used by legitimate end-users to interact with control system devices. \n\nTransient assets, in some cases, may not be deployed with a secure configuration leading to weaknesses that could allow an adversary to propagate malicious executable code, e.g., the transient asset may be infected by malware and when connected to an ICS environment the malware propagates onto other systems. \nDetection: Application Log Content, Network Traffic Flow\nMitigation: Antivirus/Antimalware, Audit, Encrypt Sensitive Information, Network Segmentation, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0864",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "5a707393-bd94-4dce-8e1b-44d599285f3f",
    "text": "ID: T0872\nName: Indicator Removal on Host\nDescription: Adversaries may attempt to remove indicators of their presence on a system in an effort to cover their tracks. In cases where an adversary may feel detection is imminent, they may try to overwrite, delete, or cover up changes they have made to the device.\nDetection: Command Execution, File Deletion, File Metadata, File Modification, OS API Execution, Process Creation, Windows Registry Key Deletion, Windows Registry Key Modification\nMitigation: Restrict File and Directory Permissions",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0872",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "177a01e0-c94f-440c-a8db-ba761e75a701",
    "text": "ID: T0809\nName: Data Destruction\nDescription: Adversaries may perform data destruction over the course of an operation. The adversary may drop or create malware, tools, or other non-native files on a target system to accomplish this, potentially leaving behind traces of malicious activities. Such non-native files and other data may be removed over the course of an intrusion to maintain a small footprint or as a standard part of the post-intrusion cleanup process. (Citation: Enterprise ATT&CK January 2018)\n\nData destruction may also be used to render operator interfaces unable to respond and to disrupt response functions from occurring as expected. An adversary may also destroy data backups that are vital to recovery after an incident.\n\nStandard file deletion commands are available on most operating system and device interfaces to perform cleanup, but adversaries may use other tools as well. Two examples are Windows Sysinternals SDelete and Active@ Killdisk.\nDetection: Command Execution, File Deletion, File Modification, Process Creation\nMitigation: Data Backup, Privileged Account Management, Restrict File and Directory Permissions",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0809",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "dc174991-b4f6-4b4b-81bf-4048f9136c29",
    "text": "ID: T0848\nName: Rogue Master\nDescription: Adversaries may setup a rogue master to leverage control server functions to communicate with outstations. A rogue master can be used to send legitimate control messages to other control system devices, affecting processes in unintended ways. It may also be used to disrupt network communications by capturing and receiving the network traffic meant for the actual master. Impersonating a master may also allow an adversary to avoid detection. \n\nIn the case of the 2017 Dallas Siren incident, adversaries used a rogue master to send command messages to the 156 distributed sirens across the city, either through a single rogue transmitter with a strong signal, or using many distributed repeaters. (Citation: Bastille April 2017) (Citation: Zack Whittaker April 2017)\nDetection: Application Log Content, Asset Inventory, Network Traffic Content, Network Traffic Flow, Device Alarm\nMitigation: Communication Authenticity, Filter Network Traffic, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0848",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "1175a2cb-ef01-4c8f-b92c-d38a62c6f12c",
    "text": "ID: T0887\nName: Wireless Sniffing\nDescription: Adversaries may seek to capture radio frequency (RF) communication used for remote control and reporting in distributed environments. RF communication frequencies vary between 3 kHz to 300 GHz, although are commonly between 300 MHz to 6 GHz. (Citation: Candell, R., Hany, M., Lee, K. B., Liu,Y., Quimby, J., Remley, K. April 2018)  The wavelength and frequency of the signal affect how the signal propagates through open air, obstacles (e.g. walls and trees) and the type of radio required to capture them. These characteristics are often standardized in the protocol and hardware and may have an effect on how the signal is captured. Some examples of wireless protocols that may be found in cyber-physical environments are: WirelessHART, Zigbee, WIA-FA, and 700 MHz Public Safety Spectrum. \n\nAdversaries may capture RF communications by using specialized hardware, such as software defined radio (SDR), handheld radio, or a computer with radio demodulator tuned to the communication frequency. (Citation: Bastille April 2017) Information transmitted over a wireless medium may be captured in-transit whether the sniffing device is the intended destination or not. This technique may be particularly useful to an adversary when the communications are not encrypted. (Citation: Gallagher, S. April 2017) \n\nIn the 2017 Dallas Siren incident, it is suspected that adversaries likely captured wireless command message broadcasts on a 700 MHz frequency during a regular test of the system. These messages were later replayed to trigger the alarm systems. (Citation: Gallagher, S. April 2017)\nDetection: Network Traffic Flow\nMitigation: Encrypt Network Traffic, Minimize Wireless Signal Propagation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0887",
      "tactic": "Discovery",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "35ecf3f5-f986-48fd-8fcf-b22a0a810e49",
    "text": "ID: T0887\nName: Wireless Sniffing\nDescription: Adversaries may seek to capture radio frequency (RF) communication used for remote control and reporting in distributed environments. RF communication frequencies vary between 3 kHz to 300 GHz, although are commonly between 300 MHz to 6 GHz. (Citation: Candell, R., Hany, M., Lee, K. B., Liu,Y., Quimby, J., Remley, K. April 2018)  The wavelength and frequency of the signal affect how the signal propagates through open air, obstacles (e.g. walls and trees) and the type of radio required to capture them. These characteristics are often standardized in the protocol and hardware and may have an effect on how the signal is captured. Some examples of wireless protocols that may be found in cyber-physical environments are: WirelessHART, Zigbee, WIA-FA, and 700 MHz Public Safety Spectrum. \n\nAdversaries may capture RF communications by using specialized hardware, such as software defined radio (SDR), handheld radio, or a computer with radio demodulator tuned to the communication frequency. (Citation: Bastille April 2017) Information transmitted over a wireless medium may be captured in-transit whether the sniffing device is the intended destination or not. This technique may be particularly useful to an adversary when the communications are not encrypted. (Citation: Gallagher, S. April 2017) \n\nIn the 2017 Dallas Siren incident, it is suspected that adversaries likely captured wireless command message broadcasts on a 700 MHz frequency during a regular test of the system. These messages were later replayed to trigger the alarm systems. (Citation: Gallagher, S. April 2017)\nDetection: Network Traffic Flow\nMitigation: Encrypt Network Traffic, Minimize Wireless Signal Propagation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0887",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "54f8a02d-160e-4b88-a1b0-67fffad47905",
    "text": "ID: T0868\nName: Detect Operating Mode\nDescription: Adversaries may gather information about a PLCs or controllers current operating mode. Operating modes dictate what change or maintenance functions can be manipulated and are often controlled by a key switch on the PLC (e.g.,  run, prog [program], and remote). Knowledge of these states may be valuable to an adversary to determine if they are able to reprogram the PLC. Operating modes and the mechanisms by which they are selected often vary by vendor and product line. Some commonly implemented operating modes are described below:  \n\n* Program - This mode must be enabled before changes can be made to a devices program. This allows program uploads and downloads between the device and an engineering workstation. Often the PLCs logic Is halted, and all outputs may be forced off. (Citation: N.A. October 2017)  \n* Run - Execution of the devices program occurs in this mode. Input and output (values, points, tags, elements, etc.) are monitored and used according to the programs logic.[Program Upload](https://attack.mitre.org/techniques/T0845) and [Program Download](https://attack.mitre.org/techniques/T0843) are disabled while in this mode. (Citation: Omron) (Citation: Machine Information Systems 2007)  (Citation: N.A. October 2017) (Citation: PLCgurus 2021)   \n* Remote - Allows for remote changes to a PLCs operation mode. (Citation: PLCgurus 2021)    \n* Stop - The PLC and program is stopped, while in this mode, outputs are forced off. (Citation: Machine Information Systems 2007)   \n* Reset - Conditions on the PLC are reset to their original states. Warm resets may retain some memory while cold resets will reset all I/O and data registers. (Citation: Machine Information Systems 2007)   \n* Test / Monitor mode - Similar to run mode, I/O is processed, although this mode allows for monitoring, force set, resets, and more generally tuning or debugging of the system. Often monitor mode may be used as a trial for initialization. (Citation: Omron)\nDetection: Network Traffic Content\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0868",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "be589056-411b-49bf-93a5-ed9dc7024c2f",
    "text": "ID: T0891\nName: Hardcoded Credentials\nDescription: Adversaries may leverage credentials that are hardcoded in software or firmware to gain an unauthorized interactive user session to an asset. Examples credentials that may be hardcoded in an asset include:\n\n* Username/Passwords\n* Cryptographic keys/Certificates\n* API tokens\n\nUnlike [Default Credentials](https://attack.mitre.org/techniques/T0812), these credentials are built into the system in a way that they either cannot be changed by the asset owner, or may be infeasible to change because of the impact it would cause to the control system operation. These credentials may be reused across whole product lines or device models and are often not published or known to the owner and operators of the asset. \n\nAdversaries may utilize these hardcoded credentials to move throughout the control system environment or provide reliable access for their tools to interact with industrial assets. \n\nDetection: Logon Session Creation, Network Traffic Content\nMitigation: Access Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0891",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "fca417ef-f3bc-4757-97d1-16f483c7870b",
    "text": "ID: T0891\nName: Hardcoded Credentials\nDescription: Adversaries may leverage credentials that are hardcoded in software or firmware to gain an unauthorized interactive user session to an asset. Examples credentials that may be hardcoded in an asset include:\n\n* Username/Passwords\n* Cryptographic keys/Certificates\n* API tokens\n\nUnlike [Default Credentials](https://attack.mitre.org/techniques/T0812), these credentials are built into the system in a way that they either cannot be changed by the asset owner, or may be infeasible to change because of the impact it would cause to the control system operation. These credentials may be reused across whole product lines or device models and are often not published or known to the owner and operators of the asset. \n\nAdversaries may utilize these hardcoded credentials to move throughout the control system environment or provide reliable access for their tools to interact with industrial assets. \n\nDetection: Logon Session Creation, Network Traffic Content\nMitigation: Access Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0891",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "b383fb4a-150b-47b6-ad0c-fe7d16a9dc65",
    "text": "ID: T0829\nName: Loss of View\nDescription: Adversaries may cause a sustained or permanent loss of view where the ICS equipment will require local, hands-on operator intervention; for instance, a restart or manual operation. By causing a sustained reporting or visibility loss, the adversary can effectively hide the present state of operations. This loss of view can occur without affecting the physical processes themselves. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\nMitigation: Data Backup, Out-of-Band Communications Channel, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0829",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "16441a91-1ad4-4016-aea8-028370f2ab28",
    "text": "ID: T0852\nName: Screen Capture\nDescription: Adversaries may attempt to perform screen capture of devices in the control system environment. Screenshots may be taken of workstations, HMIs, or other devices that display environment-relevant process, device, reporting, alarm, or related data. These device displays may reveal information regarding the ICS process, layout, control, and related schematics. In particular, an HMI can provide a lot of important industrial process information. (Citation: ICS-CERT October 2017) Analysis of screen captures may provide the adversary with an understanding of intended operations and interactions between critical devices.\nDetection: Command Execution, OS API Execution\nMitigation: Mitigation Limited or Not Effective",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0852",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "308014a5-666f-4e53-8420-a5447b1344e6",
    "text": "ID: T0805\nName: Block Serial COM\nDescription: Adversaries may block access to serial COM to prevent instructions or configurations from reaching target devices. Serial Communication ports (COM) allow communication with control system devices. Devices can receive command and configuration messages over such serial COM. Devices also use serial COM to send command and reporting messages. Blocking device serial COM may also block command messages and block reporting messages. \n\nA serial to Ethernet converter is often connected to a serial COM to facilitate communication between serial and Ethernet devices. One approach to blocking a serial COM would be to create and hold open a TCP session with the Ethernet side of the converter. A serial to Ethernet converter may have a few ports open to facilitate multiple communications. For example, if there are three serial COM available -- 1, 2 and 3 --, the converter might be listening on the corresponding ports 20001, 20002, and 20003. If a TCP/IP connection is opened with one of these ports and held open, then the port will be unavailable for use by another party. One way the adversary could achieve this would be to initiate a TCP session with the serial to Ethernet converter at 10.0.0.1 via Telnet on serial port 1 with the following command: telnet 10.0.0.1 20001.\nDetection: Application Log Content, Network Traffic Flow, Process History/Live Data, Process/Event Alarm, Process Termination\nMitigation: Network Allowlists, Network Segmentation, Out-of-Band Communications Channel",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0805",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "e770d089-0ca6-4263-98e6-5cff74f5dde1",
    "text": "ID: T0813\nName: Denial of Control\nDescription: Adversaries may cause a denial of control to temporarily prevent operators and engineers from interacting with process controls. An adversary may attempt to deny process control access to cause a temporary loss of communication with the control device or to prevent operator adjustment of process controls. An affected process may still be operating during the period of control loss, but not necessarily in a desired state. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay)\n\nIn the 2017 Dallas Siren incident operators were unable to disable the false alarms from the Office of Emergency Management headquarters. (Citation: Mark Loveless April 2017)\nMitigation: Data Backup, Out-of-Band Communications Channel, Redundancy of Service",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0813",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "30fdc0df-8029-4872-a403-af9b9e3ed262",
    "text": "ID: T0845\nName: Program Upload\nDescription: Adversaries may attempt to upload a program from a PLC to gather information about an industrial process. Uploading a program may allow them to acquire and study the underlying logic. Methods of program upload include vendor software, which enables the user to upload and read a program running on a PLC. This software can be used to upload the target program to a workstation, jump box, or an interfacing device.\nDetection: Application Log Content, Network Traffic Content, Network Traffic Flow\nMitigation: Access Management, Authorization Enforcement, Communication Authenticity, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Software Process and Device Authentication",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0845",
      "tactic": "Collection",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "68062ea2-dc66-41d1-af5d-381758b05da6",
    "text": "ID: T0812\nName: Default Credentials\nDescription: Adversaries may leverage manufacturer or supplier set default credentials on control system devices. These default credentials may have administrative permissions and may be necessary for initial configuration of the device. It is general best practice to change the passwords for these accounts as soon as possible, but some manufacturers may have devices that have passwords or usernames that cannot be changed. (Citation: Keith Stouffer May 2015)\n\nDefault credentials are normally documented in an instruction manual that is either packaged with the device, published online through official means, or published online through unofficial means. Adversaries may leverage default credentials that have not been properly modified or disabled.\nDetection: Logon Session Creation, Network Traffic Content\nMitigation: Access Management, Password Policies",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0812",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "b0ea4534-d376-44f7-a380-031c7fa58525",
    "text": "ID: T0804\nName: Block Reporting Message\nDescription: Adversaries may block or prevent a reporting message from reaching its intended target. In control systems, reporting messages contain telemetry data (e.g., I/O values) pertaining to the current state of equipment and the industrial process. By blocking these reporting messages, an adversary can potentially hide their actions from an operator.\n\nBlocking reporting messages in control systems that manage physical processes may contribute to system impact, causing inhibition of a response function. A control system may not be able to respond in a proper or timely manner to an event, such as a dangerous fault, if its corresponding reporting message is blocked. (Citation: Bonnie Zhu, Anthony Joseph, Shankar Sastry 2011)  (Citation: Electricity Information Sharing and Analysis Center; SANS Industrial Control Systems March 2016)\nDetection: Application Log Content, Network Traffic Flow, Process History/Live Data, Process/Event Alarm, Process Termination\nMitigation: Network Allowlists, Out-of-Band Communications Channel, Static Network Configuration",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0804",
      "tactic": "Inhibit Response Function",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "4d47b80b-6c7e-4f3b-b72d-5ed23ea3cbd7",
    "text": "ID: T0853\nName: Scripting\nDescription: Adversaries may use scripting languages to execute arbitrary code in the form of a pre-written script or in the form of user-supplied code to an interpreter. Scripting languages are programming languages that differ from compiled languages, in that scripting languages use an interpreter, instead of a compiler. These interpreters read and compile part of the source code just before it is executed, as opposed to compilers, which compile each and every line of code to an executable file. Scripting allows software developers to run their code on any system where the interpreter exists. This way, they can distribute one package, instead of precompiling executables for many different systems. Scripting languages, such as Python, have their interpreters shipped as a default with many Linux distributions. \n\nIn addition to being a useful tool for developers and administrators, scripting language interpreters may be abused by the adversary to execute code in the target environment. Due to the nature of scripting languages, this allows for weaponized code to be deployed to a target easily, and leaves open the possibility of on-the-fly scripting to perform a task.\nDetection: Command Execution, Module Load, Process Creation, Process Metadata, Script Execution\nMitigation: Application Isolation and Sandboxing, Disable or Remove Feature or Program, Execution Prevention",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0853",
      "tactic": "Execution",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "a149c111-4e85-4356-971c-38ef14643633",
    "text": "ID: T0828\nName: Loss of Productivity and Revenue\nDescription: Adversaries may cause loss of productivity and revenue through disruption and even damage to the availability and integrity of control system operations, devices, and related processes. This technique may manifest as a direct effect of an ICS-targeting attack or tangentially, due to an IT-targeting attack against non-segregated environments. \n\nIn cases where these operations or services are brought to a halt, the loss of productivity may eventually present an impact for the end-users or consumers of products and services. The disrupted supply-chain may result in supply shortages and increased prices, among other consequences. \n\nA ransomware attack on an Australian beverage company resulted in the shutdown of some manufacturing sites, including precautionary halts to protect key systems. (Citation: Paganini, Pierluigi June 2020) The company announced the potential for temporary shortages of their products following the attack. (Citation: Paganini, Pierluigi June 2020) (Citation: Lion Corporation June 2020) \n\nIn the 2021 Colonial Pipeline ransomware incident, the pipeline was unable to transport approximately 2.5 million barrels of fuel per day to the East Coast.  (Citation: Colonial Pipeline Company May 2021)\nMitigation: Data Backup",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0828",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "7c1d93c0-85d9-439d-a922-0dd4686ca532",
    "text": "ID: T0890\nName: Exploitation for Privilege Escalation\nDescription: Adversaries may exploit software vulnerabilities in an attempt to elevate privileges. Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Security constructs such as permission levels will often hinder access to information and use of certain techniques, so adversaries will likely need to perform privilege escalation to include use of software exploitation to circumvent those restrictions. (Citation: The MITRE Corporation) \n\nWhen initially gaining access to a system, an adversary may be operating within a lower privileged process which will prevent them from accessing certain resources on the system. Vulnerabilities may exist, usually in operating system components and software commonly running at higher permissions, that can be exploited to gain higher levels of access on the system. This could enable someone to move from unprivileged or user level permissions to SYSTEM or root permissions depending on the component that is vulnerable. This may be a necessary step for an adversary compromising an endpoint system that has been properly configured and limits other privilege escalation methods. (Citation: The MITRE Corporation)\nDetection: Application Log Content\nMitigation: Application Isolation and Sandboxing, Exploit Protection, Threat Intelligence Program, Update Software",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0890",
      "tactic": "Privilege Escalation",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "b72334d3-6681-4735-875c-32a09d1a9367",
    "text": "ID: T0886\nName: Remote Services\nDescription: Adversaries may leverage remote services to move between assets and network segments. These services are often used to allow operators to interact with systems remotely within the network, some examples are RDP, SMB, SSH, and other similar mechanisms. (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) (Citation: Dragos December 2017) (Citation: Joe Slowik April 2019) \n\nRemote services could be used to support remote access, data transmission, authentication, name resolution, and other remote functions. Further, remote services may be necessary to allow operators and administrators to configure systems within the network from their engineering or management workstations. An adversary may use this technique to access devices which may be dual-homed (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) to multiple network segments, and can be used for [Program Download](https://attack.mitre.org/techniques/T0843) or to execute attacks on control devices directly through [Valid Accounts](https://attack.mitre.org/techniques/T0859).\n\nSpecific remote services (RDP & VNC) may be a precursor to enable [Graphical User Interface](https://attack.mitre.org/techniques/T0823) execution on devices such as HMIs or engineering workstation software.\n\nBased on incident data, CISA and FBI assessed that Chinese state-sponsored actors also compromised various authorized remote access channels, including systems designed to transfer data and/or allow access between corporate and ICS networks.  (Citation: CISA AA21-201A Pipeline Intrusion July 2021)\nDetection: Command Execution, Logon Session Creation, Module Load, Network Share Access, Network Connection Creation, Network Traffic Flow, Process Creation\nMitigation: Access Management, Authorization Enforcement, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Password Policies, Software Process and Device Authentication, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0886",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "fff8a9c8-516b-4a52-b095-d9d37624e6ec",
    "text": "ID: T0886\nName: Remote Services\nDescription: Adversaries may leverage remote services to move between assets and network segments. These services are often used to allow operators to interact with systems remotely within the network, some examples are RDP, SMB, SSH, and other similar mechanisms. (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) (Citation: Dragos December 2017) (Citation: Joe Slowik April 2019) \n\nRemote services could be used to support remote access, data transmission, authentication, name resolution, and other remote functions. Further, remote services may be necessary to allow operators and administrators to configure systems within the network from their engineering or management workstations. An adversary may use this technique to access devices which may be dual-homed (Citation: Blake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer December 2017) to multiple network segments, and can be used for [Program Download](https://attack.mitre.org/techniques/T0843) or to execute attacks on control devices directly through [Valid Accounts](https://attack.mitre.org/techniques/T0859).\n\nSpecific remote services (RDP & VNC) may be a precursor to enable [Graphical User Interface](https://attack.mitre.org/techniques/T0823) execution on devices such as HMIs or engineering workstation software.\n\nBased on incident data, CISA and FBI assessed that Chinese state-sponsored actors also compromised various authorized remote access channels, including systems designed to transfer data and/or allow access between corporate and ICS networks.  (Citation: CISA AA21-201A Pipeline Intrusion July 2021)\nDetection: Command Execution, Logon Session Creation, Module Load, Network Share Access, Network Connection Creation, Network Traffic Flow, Process Creation\nMitigation: Access Management, Authorization Enforcement, Filter Network Traffic, Human User Authentication, Network Allowlists, Network Segmentation, Password Policies, Software Process and Device Authentication, User Account Management",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0886",
      "tactic": "Lateral Movement",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "23c02020-e1de-4399-8427-e77c5b718353",
    "text": "ID: T0869\nName: Standard Application Layer Protocol\nDescription: Adversaries may establish command and control capabilities over commonly used application layer protocols such as HTTP(S), OPC, RDP, telnet, DNP3, and modbus. These protocols may be used to disguise adversary actions as benign network traffic. Standard protocols may be seen on their associated port or in some cases over a non-standard port.  Adversaries may use these protocols to reach out of the network for command and control, or in some cases to other infected devices within the network.\nDetection: Network Traffic Content, Network Traffic Flow\nMitigation: Network Allowlists, Network Intrusion Prevention, Network Segmentation",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0869",
      "tactic": "Command and Control",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "87b35231-1b57-46ef-b9df-2c89db3165c8",
    "text": "ID: T0849\nName: Masquerading\nDescription: Adversaries may use masquerading to disguise a malicious application or executable as another file, to avoid operator and engineer suspicion. Possible disguises of these masquerading files can include commonly found programs, expected vendor executables and configuration files, and other commonplace application and naming conventions. By impersonating expected and vendor-relevant files and applications, operators and engineers may not notice the presence of the underlying malicious content and possibly end up running those masquerading as legitimate functions. \n\nApplications and other files commonly found on Windows systems or in engineering workstations have been impersonated before. This can be as simple as renaming a file to effectively disguise it in the ICS environment.\nDetection: Command Execution, File Metadata, File Modification, Process Metadata, Scheduled Job Creation, Scheduled Job Modification, Service Creation, Service Modification\nMitigation: Code Signing, Execution Prevention, Restrict File and Directory Permissions",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0849",
      "tactic": "Evasion",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "d000aad7-e871-4e9e-878a-7f86e73e0884",
    "text": "ID: T0873\nName: Project File Infection\nDescription: Adversaries may attempt to infect project files with malicious code. These project files may consist of objects, program organization units, variables such as tags, documentation, and other configurations needed for PLC programs to function. (Citation: Beckhoff) Using built in functions of the engineering software, adversaries may be able to download an infected program to a PLC in the operating environment enabling further [Execution](https://attack.mitre.org/tactics/TA0104) and [Persistence](https://attack.mitre.org/tactics/TA0110) techniques. (Citation: PLCdev) \n\nAdversaries may export their own code into project files with conditions to execute at specific intervals. (Citation: Nicolas Falliere, Liam O Murchu, Eric Chien February 2011) Malicious programs allow adversaries control of all aspects of the process enabled by the PLC. Once the project file is downloaded to a PLC the workstation device may be disconnected with the infected project file still executing. (Citation: PLCdev)\nDetection: File Modification\nMitigation: Audit, Code Signing, Encrypt Sensitive Information, Restrict File and Directory Permissions",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0873",
      "tactic": "Persistence",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "d4ae403e-d128-4b1d-af16-faa8b9bb9c41",
    "text": "ID: T0865\nName: Spearphishing Attachment\nDescription: Adversaries may use a spearphishing attachment, a variant of spearphishing, as a form of a social engineering attack against specific targets. Spearphishing attachments are different from other forms of spearphishing in that they employ malware attached to an email. All forms of spearphishing are electronically delivered and target a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon [User Execution](https://attack.mitre.org/techniques/T0863) to gain execution and access. (Citation: Enterprise ATT&CK October 2019) \n\nA Chinese spearphishing campaign running from December 9, 2011 through February 29, 2012, targeted ONG organizations and their employees. The emails were constructed with a high level of sophistication to convince employees to open the malicious file attachments. (Citation: CISA AA21-201A Pipeline Intrusion July 2021)\nDetection: Application Log Content, File Creation, Network Traffic Content, Process Creation\nMitigation: Antivirus/Antimalware, Network Intrusion Prevention, Restrict Web-Based Content, User Training",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0865",
      "tactic": "Initial Access",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "de43d1d8-a5d2-4a32-b71e-bb10612c14b2",
    "text": "ID: T0832\nName: Manipulation of View\nDescription: Adversaries may attempt to manipulate the information reported back to operators or controllers. This manipulation may be short term or sustained. During this time the process itself could be in a much different state than what is reported. (Citation: Corero) (Citation: Michael J. Assante and Robert M. Lee) (Citation: Tyson Macaulay) \n\nOperators may be fooled into doing something that is harmful to the system in a loss of view situation. With a manipulated view into the systems, operators may issue inappropriate control sequences that introduce faults or catastrophic failures into the system. Business analysis systems can also be provided with inaccurate data leading to bad management decisions.\nMitigation: Communication Authenticity, Data Backup, Out-of-Band Communications Channel",
    "metadata": {
      "source": "MITRE_ICS",
      "doc_type": "attack_technique",
      "technique_id": "T0832",
      "tactic": "Impact",
      "component_id": null,
      "stage_id": null
    }
  },
  {
    "id": "704962d7-b0bf-435b-a4dd-994d5edec5d7",
    "text": "Component: T101\nDescription: Raw Water Tank\nDesign Specification: Capacity: 1.8m³ Dia x H= 1.38 x 1.36\nMaterial: PE\nBrand Model: Rotamas CPE 1800",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "T101",
      "stage_id": "P1"
    }
  },
  {
    "id": "e278967d-75b2-422d-a06d-0cf3c235822c",
    "text": "Component: P101\nDescription: Raw Water Transfer Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS Impeller: Noryl Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P101",
      "stage_id": "P1"
    }
  },
  {
    "id": "9c972010-09b9-4b92-a350-deb384d5c6b1",
    "text": "Component: P102\nDescription: Raw Water Transfer Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS Impeller: Noryl Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P102",
      "stage_id": "P1"
    }
  },
  {
    "id": "be60892f-26a5-46d7-a708-96b2b875e150",
    "text": "Component: LIT101\nDescription: Raw Water Tank LIT\nDesign Specification: Ultrasonic, Range 0.2 to 6m\nMaterial: Non Contact\nBrand Model: iSOLV LevelWizard II",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT101",
      "stage_id": "P1"
    }
  },
  {
    "id": "45750678-ca1b-4022-a1c8-075483426637",
    "text": "Component: FIT101\nDescription: Raw Water FIT\nDesign Specification: Electromagnetic DN25\nMaterial: PTFE\nBrand Model: iSOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT101",
      "stage_id": "P1"
    }
  },
  {
    "id": "5f7105fe-6a06-4661-9956-a1eb1c52d8b1",
    "text": "Component: MV101\nDescription: Raw Water Inlet On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV101",
      "stage_id": "P1"
    }
  },
  {
    "id": "7be7f23a-34f8-4695-bc6b-930e16d263f0",
    "text": "Component: P201\nDescription: NaCl Dosing Pump\nDesign Specification: Capacity: 50 l/h @ 10 bar\nMaterial: Liquid end: PVDF Diaphragm: PTFE faced\nBrand Model: Prominent Sigma S1Ba",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P201",
      "stage_id": "P2"
    }
  },
  {
    "id": "18d8b4dc-590d-4b45-a302-fdd684895200",
    "text": "Component: P202\nDescription: NaCl Dosing Pump\nDesign Specification: Capacity: 50 l/h @ 10 bar\nMaterial: Liquid end: PVDF Diaphragm: PTFE faced\nBrand Model: Prominent Sigma S1Ba",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P202",
      "stage_id": "P2"
    }
  },
  {
    "id": "69de6a52-0f33-41b2-b9b9-7e5d22563c06",
    "text": "Component: P203\nDescription: HCl Dosing Pump\nDesign Specification: Capacity: 0.78 l/h @ 08 bar\nMaterial: Liquid end: Plexiglas Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P203",
      "stage_id": "P2"
    }
  },
  {
    "id": "f90798a3-d47f-46fc-9757-9ebfe2cc27e7",
    "text": "Component: P204\nDescription: HCl Dosing Pump\nDesign Specification: Capacity: 0.78 l/h @ 08 bar\nMaterial: Liquid end: Plexiglas Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P204",
      "stage_id": "P2"
    }
  },
  {
    "id": "abbde57e-f02b-47cc-bd16-dd7d614d5951",
    "text": "Component: P205\nDescription: NaOCl Dosing Pump (FAC)\nDesign Specification: Capacity: 0.78 l/h @ 8 bar\nMaterial: Liquid end: Plexiglas Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P205",
      "stage_id": "P2"
    }
  },
  {
    "id": "4ffe2c8c-9209-4c51-ba8a-9a05068ff422",
    "text": "Component: P206\nDescription: NaOCl Dosing Pump (FAC)\nDesign Specification: Capacity: 0.78 l/h @ 8 bar\nMaterial: Liquid end: Plexiglas Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P206",
      "stage_id": "P2"
    }
  },
  {
    "id": "e1d6b332-fcb6-4ea8-9b10-0704b724ead1",
    "text": "Component: P207\nDescription: NaOCl Dosing Pump (UF Cleaning)\nDesign Specification: Capacity: 65l/h @ 7 bar\nMaterial: Liquid end: PVDF Diaphragm: PTFE faced\nBrand Model: Prominent Sigma S1Ba",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P207",
      "stage_id": "P2"
    }
  },
  {
    "id": "d8abc321-5d22-4606-9519-223a74db859b",
    "text": "Component: P208\nDescription: NaOCl Dosing Pump (UF Cleaning)\nDesign Specification: Capacity: 65l/h @ 7 bar\nMaterial: Liquid end: PVDF Diaphragm: PTFE faced\nBrand Model: Prominent Sigma S1Ba",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P208",
      "stage_id": "P2"
    }
  },
  {
    "id": "5d814822-b026-4ed1-9809-a6acff7b763d",
    "text": "Component: FIT201\nDescription: Raw Water to UF Feed Tank FIT\nDesign Specification: Electromagnetic DN25\nMaterial: PTFE\nBrand Model: iSOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT201",
      "stage_id": "P2"
    }
  },
  {
    "id": "8ab2aa7f-e9c6-43f0-98e6-393998f94133",
    "text": "Component: AIT201\nDescription: AIT - Conductivity\nDesign Specification: Up to 1000µS/cm\nMaterial: -\nBrand Model: Mettler Toledo M300 Single/ easySense Cond 71",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT201",
      "stage_id": "P2"
    }
  },
  {
    "id": "55094443-da17-4072-bd1d-984fd8cb9738",
    "text": "Component: AIT202\nDescription: AIT - pH & ORP\nDesign Specification: pH: 0-14 ORP: -800mV to 800mV\nMaterial: -\nBrand Model: Mettler Toledo M300 Dual/ easySense pH 32 & ORP 41",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT202",
      "stage_id": "P2"
    }
  },
  {
    "id": "4cb64c26-97b4-4933-b51f-5ed7b5519bda",
    "text": "Component: AIT203\nDescription: AIT - pH & ORP\nDesign Specification: pH: 0-14 ORP: -800mV to 800mV\nMaterial: -\nBrand Model: Mettler Toledo M300 Dual/ easySense pH 32 & ORP 41",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT203",
      "stage_id": "P2"
    }
  },
  {
    "id": "b9ede7ef-da56-4ad8-b86f-2f14a29f6df8",
    "text": "Component: LS201\nDescription: NaCl Level Switch\nDesign Specification: Low Alarm\nMaterial: PVC\nBrand Model: iSOLV LS880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS201",
      "stage_id": "P2"
    }
  },
  {
    "id": "3336fa17-cc51-4e14-9952-7ed1151b000f",
    "text": "Component: LS202\nDescription: HCl Level Switch\nDesign Specification: Low Alarm\nMaterial: PVC\nBrand Model: iSOLV LS880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS202",
      "stage_id": "P2"
    }
  },
  {
    "id": "44540d7b-6acc-4b6c-b4fc-8915dd2381fa",
    "text": "Component: LS203\nDescription: NaOCl Level Switch\nDesign Specification: Low Alarm\nMaterial: PVC\nBrand Model: iSOLV LS880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS203",
      "stage_id": "P2"
    }
  },
  {
    "id": "51197712-30a2-4891-a28e-528635d64310",
    "text": "Component: MV201\nDescription: Raw Water Tank Outlet On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV201",
      "stage_id": "P2"
    }
  },
  {
    "id": "6cab6f58-b871-41af-ac86-5968db9e98a4",
    "text": "Component: T301\nDescription: UF Feedwater Tank\nDesign Specification: Capacity: 1.8m³, Dia x H= 1.38 x 1.36\nMaterial: PE\nBrand Model: Rotamas CPE 1800",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "T301",
      "stage_id": "P3"
    }
  },
  {
    "id": "90965a1c-3aa9-4c87-8394-c19d8546dc28",
    "text": "Component: P301\nDescription: UF Feedwater Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P301",
      "stage_id": "P3"
    }
  },
  {
    "id": "0caa30c7-279c-4df3-9932-f7d797a79848",
    "text": "Component: P302\nDescription: UF Feedwater Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P302",
      "stage_id": "P3"
    }
  },
  {
    "id": "1e3bf125-2001-4dda-ae0b-2875a75ac232",
    "text": "Component: LIT301\nDescription: UF Feed Water Tank LIT\nDesign Specification: Ultrasonic, Range 0.2 to 6m\nMaterial: Non Contact\nBrand Model: ISOLV LevelWizard II",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT301",
      "stage_id": "P3"
    }
  },
  {
    "id": "4983cf93-d63b-4c51-9637-0336f0d44936",
    "text": "Component: FIT301\nDescription: UF Feed Water FIT\nDesign Specification: Electromagnetic, DN25\nMaterial: PTFE\nBrand Model: ISOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT301",
      "stage_id": "P3"
    }
  },
  {
    "id": "fb7136f5-abdc-48c0-ab56-5ebe6c0d73ef",
    "text": "Component: FI301\nDescription: UF Feed Water FI\nDesign Specification: Rotameter, 1\"\nMaterial: PVC\nBrand Model: FSI Flowmeter",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FI301",
      "stage_id": "P3"
    }
  },
  {
    "id": "cb95f12c-5868-48fb-99c5-a50808bea3b5",
    "text": "Component: PSH301\nDescription: Pressure Switch\nDesign Specification: Switch High/ 0-7 Bar, Adjustable\nMaterial: SS316 Port\nBrand Model: CCS 604G2",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSH301",
      "stage_id": "P3"
    }
  },
  {
    "id": "b27451a4-c38d-4c82-a39f-2d8ce300d46f",
    "text": "Component: DPSH301\nDescription: Differential Pressure Switch\nDesign Specification: Switch High/ 0-1 Bar\nMaterial: SS316 Port\nBrand Model: CCS 604DZ",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "DPSH301",
      "stage_id": "P3"
    }
  },
  {
    "id": "5acfef8a-799e-433e-b6b4-ec4753a708d5",
    "text": "Component: DPIT301\nDescription: Differential Pressure Indicating Transmitter\nDesign Specification: Range: 0-2 Bar\nMaterial: SS316 Port\nBrand Model: SPT 100 DP",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "DPIT301",
      "stage_id": "P3"
    }
  },
  {
    "id": "56636fc3-6ef7-4901-8921-b7bfa9f12e86",
    "text": "Component: MV301\nDescription: Backwash On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV301",
      "stage_id": "P3"
    }
  },
  {
    "id": "e5265ed7-7601-4516-b6c4-8e21b41540f9",
    "text": "Component: MV302\nDescription: Backwash On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV302",
      "stage_id": "P3"
    }
  },
  {
    "id": "ea6b5c72-e63f-4d9b-a743-8ac42ad5b9bc",
    "text": "Component: MV303\nDescription: Backwash On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV303",
      "stage_id": "P3"
    }
  },
  {
    "id": "d306c318-c62a-4407-8da9-8fddc4646396",
    "text": "Component: MV304\nDescription: Backwash On/Off Valve\nDesign Specification: DN 25, Electric Actuated\nMaterial: PVC\nBrand Model: Burkert EV2650",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV304",
      "stage_id": "P3"
    }
  },
  {
    "id": "a9e4d638-a8be-438c-b49d-4df5e9b307a2",
    "text": "Component: T401\nDescription: RO Feedwater Tank\nDesign Specification: Capacity: 1.8m³, Dia x H= 1.38 x 1.36\nMaterial: PE\nBrand Model: Rotamas CPE 1800",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "T401",
      "stage_id": "P4"
    }
  },
  {
    "id": "31b9fdc9-29dc-49fc-8248-f603b624dbb9",
    "text": "Component: P401\nDescription: RO Feedwater Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P401",
      "stage_id": "P4"
    }
  },
  {
    "id": "cbe306cf-b385-4e27-8329-0ce55ffecce4",
    "text": "Component: P402\nDescription: RO Feedwater Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P402",
      "stage_id": "P4"
    }
  },
  {
    "id": "e46bb06a-4199-405c-a371-6174035aa0cb",
    "text": "Component: P403\nDescription: NaHSO₃ Dosing Pump\nDesign Specification: Capacity: 0.78 l/h @ 8 bar\nMaterial: Liquid end: Plexiglas, Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P403",
      "stage_id": "P4"
    }
  },
  {
    "id": "95fa7924-bcb1-4fa7-bb4a-48f3ee668038",
    "text": "Component: P404\nDescription: NaHSO₃ Dosing Pump\nDesign Specification: Capacity: 0.78 l/h @ 8 bar\nMaterial: Liquid end: Plexiglas, Diaphragm: PTFE faced\nBrand Model: Prominent GALa1601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P404",
      "stage_id": "P4"
    }
  },
  {
    "id": "b604c860-5b95-43c0-9cf1-8718df39536a",
    "text": "Component: UV401\nDescription: UV Unit\nDesign Specification: Removal up to 0.5ppm, 2.3m³/h\nMaterial: SS316\nBrand Model: Aquafine Optima 200",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "UV401",
      "stage_id": "P4"
    }
  },
  {
    "id": "ba8e635d-9da8-4e89-aa75-a9e98ab49539",
    "text": "Component: LIT401\nDescription: RO Feed Water Tank LIT\nDesign Specification: Ultrasonic, Range 0.2 to 6m\nMaterial: Non Contact\nBrand Model: ISOLV LevelWizard II",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "c6ac190b-cbf1-4e12-a31d-7edda29401e3",
    "text": "Component: AIT401\nDescription: Hardness Monitor\nDesign Specification: Range: 0-10ppm\nMaterial: -\nBrand Model: HACH APA 6000",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "3902a304-94f2-4a69-a182-f4aaf1260e9e",
    "text": "Component: AIT402\nDescription: AIT ~ORP\nDesign Specification: ORP: -800mV to 800mV\nMaterial: -\nBrand Model: Mettler Toledo M200 Single/easySense ORP 41",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT402",
      "stage_id": "P4"
    }
  },
  {
    "id": "97f31cc9-21b1-40ff-918e-332ae78a2f64",
    "text": "Component: FIT401\nDescription: RO Feed FIT\nDesign Specification: Electromagnetic, DN25\nMaterial: PTFE\nBrand Model: ISOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "c0d2ffda-57f1-4d3f-82ef-ca239feeed63",
    "text": "Component: AIT501\nDescription: AIT - pH & ORP (RO Feed)\nDesign Specification: pH: 0-14 ORP: -800mV to 800mV\nMaterial: -\nBrand Model: Mettler Toledo M300 Dual/ easySense pH 32 & ORP 41",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT501",
      "stage_id": "P5"
    }
  },
  {
    "id": "79067fa3-0885-4a16-9790-800647b8c017",
    "text": "Component: AIT502\nDescription: AIT - pH & ORP (RO Feed)\nDesign Specification: pH: 0-14 ORP: -800mV to 800mV\nMaterial: -\nBrand Model: Mettler Toledo M300 Dual/ easySense pH 32 & ORP 41",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT502",
      "stage_id": "P5"
    }
  },
  {
    "id": "85ebdff5-a6e7-4385-a175-5a60cdf57ee8",
    "text": "Component: PSL501\nDescription: Pressure Switch (Before High Pressure RO Pump)\nDesign Specification: Low Alarm: 0-10 Bar (Adjustable)\nMaterial: SS316 Port\nBrand Model: CCS 604G2",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSL501",
      "stage_id": "P5"
    }
  },
  {
    "id": "6ce5b384-5101-4f38-8b92-72a343be1466",
    "text": "Component: PSH501\nDescription: Pressure Switch (After High Pressure RO Pump)\nDesign Specification: High Alarm: 0-10 Bar (Adjustable)\nMaterial: SS316 Port\nBrand Model: CCS 604G1",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSH501",
      "stage_id": "P5"
    }
  },
  {
    "id": "bceb2c12-f1dd-4d48-9d2c-71c014b1eda3",
    "text": "Component: PIT501\nDescription: PIT (After High Pressure RO Pump)\nDesign Specification: 0-10 Bar\nMaterial: SS316 Port\nBrand Model: iSOLV SPT 100",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT501",
      "stage_id": "P5"
    }
  },
  {
    "id": "5ba22037-bad2-4200-9887-3dc3384d8548",
    "text": "Component: PIT503\nDescription: FIT (RO Concentrate)\nDesign Specification: 0-10 Bar\nMaterial: SS316 Port\nBrand Model: iSOLV SPT 100",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT503",
      "stage_id": "P5"
    }
  },
  {
    "id": "bc3cc547-ccf7-473e-b2ad-cf45f0dc86e7",
    "text": "Component: PIT502\nDescription: FIT (RO Permeate)\nDesign Specification: 0-10 Bar\nMaterial: SS316 Port\nBrand Model: iSOLV SPT 100",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT502",
      "stage_id": "P5"
    }
  },
  {
    "id": "8e3c00b7-6fb0-4b3f-a9fa-ca8db8d0f599",
    "text": "Component: P501\nDescription: High Pressure RO Pump With VSD\nDesign Specification: Duty: 2.5 m³/h @ 5bar\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 206",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P501",
      "stage_id": "P5"
    }
  },
  {
    "id": "ccdb6e04-94cc-4e0a-a73d-2e5bb3cacd7d",
    "text": "Component: P505\nDescription: High Pressure RO Pump With VSD\nDesign Specification: Duty: 2.5 m³/h @ 5bar\nMaterial: Casing: Chrome Nickel SS, Impeller: Noryl, Shaft: SS\nBrand Model: CALPEDA MXH 206",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P505",
      "stage_id": "P5"
    }
  },
  {
    "id": "1520fc28-8c7f-4981-a623-1e4949e5aae0",
    "text": "Component: AIT503\nDescription: AIT - Conductivity (RO Feed)\nDesign Specification: Up to 1000μS/cm\nMaterial: -\nBrand Model: Mettler Toledo M300 Dual/ easySense Cond 71",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT503",
      "stage_id": "P5"
    }
  },
  {
    "id": "2f68d5e4-b6a0-4a41-ae17-54e36ce093fb",
    "text": "Component: FIT503\nDescription: FIT (RO Concentrate)\nDesign Specification: Electromagnetic DN25\nMaterial: PTFE\nBrand Model: iSOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT503",
      "stage_id": "P5"
    }
  },
  {
    "id": "dcdf8b45-0140-46b5-b656-7c1462c450e1",
    "text": "Component: AIT504\nDescription: AIT - Conductivity (RO Permeate)\nDesign Specification: Range: 0.02 to 20 μS/cm\nMaterial: -\nBrand Model: easySense Cond 71",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT504",
      "stage_id": "P5"
    }
  },
  {
    "id": "faf3e5ac-42bf-4881-a7bb-13b2bb6c388a",
    "text": "Component: FIT504\nDescription: FIT (RO Recirculation)\nDesign Specification: Electromagnetic DN25\nMaterial: PTFE\nBrand Model: iSOLV EFS803/CFT183",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT504",
      "stage_id": "P5"
    }
  },
  {
    "id": "067e79cd-c0a6-475a-aa24-ad24ca2cd7db",
    "text": "Component: T601\nDescription: RO Permeate Tank\nDesign Specification: Capacity: 1.2m³ Dia×H = 1.16 x 1.24\nMaterial: PE\nBrand Model: Rotamas CPE 1200",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "T601",
      "stage_id": "P6"
    }
  },
  {
    "id": "e2996711-90b0-4ba9-b20b-200d8ea5b1e4",
    "text": "Component: P601\nDescription: RO Permeate Transfer Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS Impeller: Noryl Shaft: SS\nBrand Model: CALPEDA MXP 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P601",
      "stage_id": "P6"
    }
  },
  {
    "id": "25d45744-f3a4-4644-816b-8fb670eabbb8",
    "text": "Component: T602\nDescription: UF Backwash Tank\nDesign Specification: Capacity: 1.2m³ Dia×H = 1.16 x 1.24\nMaterial: PE\nBrand Model: Rotamas CPE 1200",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "T602",
      "stage_id": "P6"
    }
  },
  {
    "id": "34bd4734-df29-4732-af8d-79fa4439e404",
    "text": "Component: P602\nDescription: UF Backwash Tank Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS Impeller: Noryl Shaft: SS\nBrand Model: CALPEDA MXP 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P602",
      "stage_id": "P6"
    }
  },
  {
    "id": "8f1847c9-74cb-4f9e-bf0e-d96d6caf6477",
    "text": "Component: P603\nDescription: CIP Pump\nDesign Specification: Duty: 2.5 m³/h @ 20m\nMaterial: Casing: Chrome Nickel SS Impeller: Noryl Shaft: SS\nBrand Model: CALPEDA MXP 203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "P603",
      "stage_id": "P6"
    }
  },
  {
    "id": "f26934bb-b469-4bf3-bb2f-18514c16215b",
    "text": "Component: LS601\nDescription: RO Permeate Tank Level Switch\nDesign Specification: Low & High Alarm\nMaterial: PVC\nBrand Model: iSOLV L5880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS601",
      "stage_id": "P6"
    }
  },
  {
    "id": "a9971a51-00f2-4d75-9e0f-1c36d318fd79",
    "text": "Component: LS602\nDescription: UF Backwash Tank Level Switch\nDesign Specification: Low & High Alarm\nMaterial: PVC\nBrand Model: iSOLV L5880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS602",
      "stage_id": "P6"
    }
  },
  {
    "id": "47701c5f-5d2e-4952-9948-58d5a08c2527",
    "text": "Component: LS603\nDescription: CIP Tank Level Switch\nDesign Specification: Low & High Alarm\nMaterial: PVC\nBrand Model: iSOLV L5880",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS603",
      "stage_id": "P6"
    }
  },
  {
    "id": "de74ccb9-3743-4fd9-b901-0add5161c1e3",
    "text": "Component: FIT601\nDescription: FIT (UF Backwash)\nDesign Specification: Electromagnetic DN25\nMaterial: PTFE\nBrand Model: iSOLV EFS803/CFT180",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT601",
      "stage_id": "P6"
    }
  },
  {
    "id": "c7f21038-53d2-454d-ac77-e86ba390c106",
    "text": "Component: FI601\nDescription: FI (RO/UF Cleaning)\nDesign Specification: Rotameter; 1\"\nMaterial: PVC\nBrand Model: FSIV Flowmeter",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FI601",
      "stage_id": "P6"
    }
  },
  {
    "id": "e301b326-dcb0-47b4-843f-7aeea8599f27",
    "text": "Component: FI602\nDescription: FI (RO/UF Cleaning)\nDesign Specification: Rotameter; 1\"\nMaterial: PVC\nBrand Model: FSIV Flowmeter",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "component",
      "technique_id": null,
      "tactic": null,
      "component_id": "FI602",
      "stage_id": "P6"
    }
  },
  {
    "id": "e34cb1e8-c35c-4185-9824-89dc8e6492bc",
    "text": "Component: FIT101\nConnects to: MV101",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT101",
      "stage_id": "P1"
    }
  },
  {
    "id": "8fee43e6-de7a-40c0-90b1-9714c92a9f9c",
    "text": "Component: MV101\nConnects to: T101",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV101",
      "stage_id": "P1"
    }
  },
  {
    "id": "dd7c7bbb-2286-4337-b153-21d6ddcee9fc",
    "text": "Component: LIT101\nConnects to: T101",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT101",
      "stage_id": "P1"
    }
  },
  {
    "id": "1d2bf528-0dbe-403f-ad71-eafc235f9071",
    "text": "Component: T101\nConnects to: P101, P102",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T101",
      "stage_id": "P1"
    }
  },
  {
    "id": "3382868c-e5ec-41ab-aa55-cfa08e7a575c",
    "text": "Component: P101\nConnects to: AIT201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P101",
      "stage_id": "P1"
    }
  },
  {
    "id": "3751f827-eefc-49c0-b29c-7c9eea436831",
    "text": "Component: P102\nConnects to: AIT201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P102",
      "stage_id": "P1"
    }
  },
  {
    "id": "813a4548-93b3-40dc-9f63-574929bb4ba4",
    "text": "Component: AIT201\nConnects to: P201, P202, P203, P204, P205, P206, P207, P208",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT201",
      "stage_id": "P2"
    }
  },
  {
    "id": "2222be49-6731-4561-a381-1e814015963f",
    "text": "Component: AIT202\nConnects to: MV201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT202",
      "stage_id": "P2"
    }
  },
  {
    "id": "9acd451a-7c79-4cbd-b848-5e5e64a6c5a2",
    "text": "Component: AIT203\nConnects to: MV201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT203",
      "stage_id": "P2"
    }
  },
  {
    "id": "f8871f71-a901-4d9c-8dd2-e629220cba2b",
    "text": "Component: P201\nConnects to: T201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P201",
      "stage_id": "P2"
    }
  },
  {
    "id": "fa8f3a5c-44b5-488e-bea7-27458eb17895",
    "text": "Component: P202\nConnects to: T201",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P202",
      "stage_id": "P2"
    }
  },
  {
    "id": "be400faa-eb7f-4110-b131-27b455d6ad34",
    "text": "Component: P203\nConnects to: T202",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P203",
      "stage_id": "P2"
    }
  },
  {
    "id": "75dd5d1e-bdc6-4655-ae0b-624d43182357",
    "text": "Component: P204\nConnects to: T202",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P204",
      "stage_id": "P2"
    }
  },
  {
    "id": "0681a134-98cd-4c24-bde7-3ce67d5e6938",
    "text": "Component: P205\nConnects to: T203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P205",
      "stage_id": "P2"
    }
  },
  {
    "id": "bce2e961-dafe-40fd-bd2c-2d04ac7d362e",
    "text": "Component: P206\nConnects to: T203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P206",
      "stage_id": "P2"
    }
  },
  {
    "id": "9227d5eb-13da-4d7b-8958-32cbdec60ace",
    "text": "Component: P207\nConnects to: T203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P207",
      "stage_id": "P2"
    }
  },
  {
    "id": "ded2d81b-974c-4ad1-8f48-e7b99c3f19a8",
    "text": "Component: P208\nConnects to: T203",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P208",
      "stage_id": "P2"
    }
  },
  {
    "id": "6e3d6700-5886-4391-9c78-eefc565f6acf",
    "text": "Component: MV201\nConnects to: T301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV201",
      "stage_id": "P2"
    }
  },
  {
    "id": "7a26014a-e237-4bda-85c8-d8d8a0c86c47",
    "text": "Component: LIT301\nConnects to: T301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT301",
      "stage_id": "P3"
    }
  },
  {
    "id": "a286aa57-3c8e-4123-ac27-735a6937a743",
    "text": "Component: T301\nConnects to: P301, P302",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T301",
      "stage_id": "P3"
    }
  },
  {
    "id": "94fcce5f-bda1-41e0-b629-11631914fdff",
    "text": "Component: P301\nConnects to: FIT301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P301",
      "stage_id": "P3"
    }
  },
  {
    "id": "1ab5c3e7-c560-4da0-91b5-1b41fe3260e3",
    "text": "Component: P302\nConnects to: FIT301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P302",
      "stage_id": "P3"
    }
  },
  {
    "id": "7801c9e4-7d17-42b2-b436-037554fda01c",
    "text": "Component: FIT301\nConnects to: FI301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT301",
      "stage_id": "P3"
    }
  },
  {
    "id": "e4456675-38a6-4e8a-83bc-b9e0b8b6117b",
    "text": "Component: MV301\nConnects to: MV302, DPSH301, DPIT301",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV301",
      "stage_id": "P3"
    }
  },
  {
    "id": "97b3dd9a-698f-4af1-98fe-1271501ef8e3",
    "text": "Component: MV302\nConnects to: T401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV302",
      "stage_id": "P3"
    }
  },
  {
    "id": "53165fcf-7ec7-49cc-a904-fbfb628212e0",
    "text": "Component: PSH301\nConnects to: MV303",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSH301",
      "stage_id": "P3"
    }
  },
  {
    "id": "1aa72e9e-105c-4977-8e49-7dc69b3b5863",
    "text": "Component: LIT401\nConnects to: T401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "64f3fdca-6d5a-4b8a-bb65-506313ccf8b1",
    "text": "Component: T401\nConnects to: P401, P402",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T401",
      "stage_id": "P4"
    }
  },
  {
    "id": "4521d8f4-d4c0-4307-8404-3ab060e97a7c",
    "text": "Component: P401\nConnects to: AIT401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P401",
      "stage_id": "P4"
    }
  },
  {
    "id": "ebd137a9-3449-4066-a3d1-5bded7a44819",
    "text": "Component: P402\nConnects to: AIT401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P402",
      "stage_id": "P4"
    }
  },
  {
    "id": "667aed0a-a7d2-4703-ae65-68de7de13580",
    "text": "Component: AIT401\nConnects to: FIT401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "056f4172-de76-431d-b026-6210bed77217",
    "text": "Component: FIT401\nConnects to: UV401",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT401",
      "stage_id": "P4"
    }
  },
  {
    "id": "aa1b2ab8-6965-43c9-939a-2e4f23f9a859",
    "text": "Component: UV401\nConnects to: AIT402",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "UV401",
      "stage_id": "P4"
    }
  },
  {
    "id": "3ac35fb7-35eb-43c1-895d-47a7823a94ec",
    "text": "Component: AIT402\nConnects to: P403, P404, FIT501",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT402",
      "stage_id": "P4"
    }
  },
  {
    "id": "8e733ad9-931b-4a4b-a342-8f31dbbaeb10",
    "text": "Component: P403\nConnects to: T402",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P403",
      "stage_id": "P4"
    }
  },
  {
    "id": "45a2b36d-fe5d-4f3e-8d34-b2e839d7840d",
    "text": "Component: P404\nConnects to: T402",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P404",
      "stage_id": "P4"
    }
  },
  {
    "id": "1fc73956-04df-43e1-b79e-d1f61aeedc1b",
    "text": "Component: FIT501\nConnects to: P501, P502, FIT504",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT501",
      "stage_id": "P5"
    }
  },
  {
    "id": "437d0d8a-67bb-429a-843e-834d90eab41c",
    "text": "Component: P501\nConnects to: PIT501",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P501",
      "stage_id": "P5"
    }
  },
  {
    "id": "073d8c5f-e980-494a-ab5c-b760baa475ea",
    "text": "Component: P502\nConnects to: PIT501",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P502",
      "stage_id": "P5"
    }
  },
  {
    "id": "293625e4-733c-4863-8ac7-9361bf56b898",
    "text": "Component: PIT501\nConnects to: PSH501",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT501",
      "stage_id": "P5"
    }
  },
  {
    "id": "69d27555-40c3-476e-99ae-6188d2e3a63b",
    "text": "Component: PSH501\nConnects to: RO501",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSH501",
      "stage_id": "P5"
    }
  },
  {
    "id": "547508f3-2be6-4c2b-bc39-19efd12eaa11",
    "text": "Component: PSH501\nConnects to: RO502",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PSH501",
      "stage_id": "P5"
    }
  },
  {
    "id": "7aec5858-655f-427a-8f23-174d728c660f",
    "text": "Component: RO501\nConnects to: PIT502, RO503",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "RO501",
      "stage_id": "P5"
    }
  },
  {
    "id": "4ef4a8aa-5090-4863-870a-95720d97703b",
    "text": "Component: RO502\nConnects to: PIT502, RO503",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "RO502",
      "stage_id": "P5"
    }
  },
  {
    "id": "a651d7ec-3a76-4b6c-b18a-73ff009bac93",
    "text": "Component: RO503\nConnects to: PIT502, FIT503",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "RO503",
      "stage_id": "P5"
    }
  },
  {
    "id": "cf95e047-659c-4be7-9796-f1cab22b710a",
    "text": "Component: FIT503\nConnects to: PIT503",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT503",
      "stage_id": "P5"
    }
  },
  {
    "id": "6cfc4fdd-d9c4-40ad-97ae-b3ce71cde127",
    "text": "Component: FIT504\nConnects to: MV504, MV502",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT504",
      "stage_id": "P5"
    }
  },
  {
    "id": "84475b3a-0318-4da9-a66c-15beae02a6cc",
    "text": "Component: PIT503\nConnects to: MV504, MV502",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT503",
      "stage_id": "P5"
    }
  },
  {
    "id": "ee77c52d-b6dc-442a-94c5-52aad51c7a5a",
    "text": "Component: PIT502\nConnects to: AIT504",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "PIT502",
      "stage_id": "P5"
    }
  },
  {
    "id": "018cd455-3fe5-46ee-8c42-07d084f6da93",
    "text": "Component: AIT504\nConnects to: FIT502",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "AIT504",
      "stage_id": "P5"
    }
  },
  {
    "id": "cf573c04-b3a9-482d-ac7d-d880b39bb3a3",
    "text": "Component: FIT502\nConnects to: MV-501, MV503",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "FIT502",
      "stage_id": "P5"
    }
  },
  {
    "id": "1ebb7a7b-6a4e-4ff6-85fe-cef690cb4d51",
    "text": "Component: MV501\nConnects to: T601, T603",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV501",
      "stage_id": "P5"
    }
  },
  {
    "id": "ee239c47-6fc4-40ae-b0a6-05799761dd2d",
    "text": "Component: MV502\nConnects to: T602",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "MV502",
      "stage_id": "P5"
    }
  },
  {
    "id": "e00cb73b-0e0e-4c1a-99cc-600ac8d48d29",
    "text": "Component: LS601\nConnects to: T601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS601",
      "stage_id": "P6"
    }
  },
  {
    "id": "5bad9665-25d0-44e7-a83c-64a576179335",
    "text": "Component: T601\nConnects to: P601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T601",
      "stage_id": "P6"
    }
  },
  {
    "id": "bc515153-dc49-4850-a2b0-afd4d7216b9d",
    "text": "Component: LS602\nConnects to: T602",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS602",
      "stage_id": "P6"
    }
  },
  {
    "id": "e67a4fbd-eda0-4353-b27b-750b3980847b",
    "text": "Component: T602\nConnects to: P602",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T602",
      "stage_id": "P6"
    }
  },
  {
    "id": "f29c0502-58a7-4a90-920c-87ac493e3f9a",
    "text": "Component: P602\nConnects to: FIT601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P602",
      "stage_id": "P6"
    }
  },
  {
    "id": "5ece865a-b1b8-4fa3-8652-05cdcb9a9b87",
    "text": "Component: LS603\nConnects to: T603",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "LS603",
      "stage_id": "P6"
    }
  },
  {
    "id": "6610b5ac-3838-4514-8c56-e021c61c25b7",
    "text": "Component: T603\nConnects to: P603",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "T603",
      "stage_id": "P6"
    }
  },
  {
    "id": "061319b7-40a7-4d22-93f6-0d0a9251ab63",
    "text": "Component: P603\nConnects to: FI601",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "pid",
      "technique_id": null,
      "tactic": null,
      "component_id": "P603",
      "stage_id": "P6"
    }
  },
  {
    "id": "bd25b99a-4441-45b2-8750-4e13af80888c",
    "text": "Stage: P1\nName: Raw water supply & storage\nDescription: Stores and supplies raw water to the treatment process. Involves raw water tank, pumps, and initial flow measurement.\nComponents:\n- LIT101 (Raw water tank level sensor)\n- MV101 (Inlet control valve for raw water tank)\n- FIT101 (Raw water flow sensor)\n- P101 (Raw water pump)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P1"
    }
  },
  {
    "id": "e77aab93-700b-4043-aadb-105b441bfabb",
    "text": "Stage: P2\nName: Chemical dosing\nDescription: Involves dosing the raw water with chemicals such as HCl, NaOCl, and NaCl to adjust pH and disinfect. A static mixer ensures proper mixing.\nComponents:\n- P201 (HCl dosing pump)\n- P203 (NaOCl dosing pump)\n- P205 (NaCl dosing pump)\n- FIT201 (Flow indicator transmitter for chemical dosing)\n- AIT201 (Analyzer indicator transmitter for chemical properties)\n- AIT202 (Analyzer indicator transmitter for pH)\n- AIT203 (Analyzer indicator transmitter for chlorine levels)\n- MV201 (Motorized valve for controlling flow after static mixer)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P2"
    }
  },
  {
    "id": "08af8eb7-4619-47aa-b74b-3e2199b909c6",
    "text": "Stage: P3\nName: Ultrafiltration (UF)\nDescription: Filters the chemically treated water through an ultrafiltration unit to remove fine particles and impurities.\nComponents:\n- LIT301 (UF feed tank level sensor)\n- DPIT301 (Differential pressure indicator transmitter for UF unit)\n- P301 (UF feed pump)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P3"
    }
  },
  {
    "id": "3bfd1439-cd21-4054-a67a-758724a611f2",
    "text": "Stage: P4\nName: Dechlorination\nDescription: Dechlorinates the filtered water using UV lamps and adds NaHSO3 to neutralize residual chlorine. The water is then stored in an RO feed tank.\nComponents:\n- P401 (RO feed pump)\n- LIT401 (RO feed tank level sensor)\n- FIT401 (Flow indicator transmitter for RO feed)\n- AIT402 (Analyzer indicator transmitter for dechlorination process)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P4"
    }
  },
  {
    "id": "bb3c76d6-0151-45f6-ad4e-e1732956eefe",
    "text": "Stage: P5\nName: Reverse Osmosis (RO)\nDescription: Processes the dechlorinated water through a reverse osmosis unit to remove dissolved salts and impurities, producing permeate and reject streams.\nComponents:\n- P501 (RO boost pump)\n- AIT503 (Analyzer indicator transmitter for cartridge filter)\n- AIT504 (Analyzer indicator transmitter for RO permeate)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P5"
    }
  },
  {
    "id": "7df46a8b-3c3f-4a22-95ce-619ff6debc71",
    "text": "Stage: P6\nName: RO permeate transfer, UF backwash\nDescription: Uses RO permeate to backwash and clean the UF membranes, recycling water back into the process.\nComponents:\n- P602 (UF backwash pump)\n",
    "metadata": {
      "source": "SWaT_DOC",
      "doc_type": "stage",
      "technique_id": null,
      "tactic": null,
      "component_id": null,
      "stage_id": "P6"
    }
  }
]